[
  {
    "title": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"The Great Gatsby\" by F. Scott Fitzgerald is a poignant exploration of the American Dream, set in the opulent Jazz Age of the 1920s. Through the eyes of narrator Nick Carraway, the novel delves into themes of love, wealth, and societal excess, centered around the enigmatic figure of Jay Gatsby and his relentless pursuit of a lost romance."
  },
  {
    "title": "Ulysses",
    "author": "James Joyce",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "\"Ulysses\" by James Joyce is a groundbreaking modernist novel that chronicles a single day in the life of Leopold Bloom as he navigates the streets of Dublin on June 16, 1904. Through its stream-of-consciousness narrative and intricate structure, the book parallels Homer’s \"Odyssey,\" exploring themes of identity, belonging, and the complexities of human experience."
  },
  {
    "title": "In Search of Lost Time",
    "author": "Marcel Proust",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"In Search of Lost Time\" by Marcel Proust is a monumental novel that explores themes of memory, time, and art through the introspective journey of its narrator, who seeks to understand the nature of human experience. Through rich and intricate prose, Proust intricately weaves personal reflections with social observations, capturing the nuances of relationships and the passage of time."
  },
  {
    "title": "One Hundred Years of Solitude",
    "author": "Gabriel García Márquez",
    "category": "800 Literature",
    "genre": "Dark",
    "description": "\"One Hundred Years of Solitude\" by Gabriel García Márquez chronicles the multi-generational story of the Buendía family in the fictional town of Macondo, blending magic realism with profound themes of solitude, fate, and the cyclical nature of history. Through lush, poetic prose, the novel explores the complexities of human experience, touching on love, war, and the inevitable passage of time."
  },
  {
    "title": "The Catcher in the Rye",
    "author": "J. D. Salinger",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Catcher in the Rye\" by J.D. Salinger follows the experiences of Holden Caulfield, a disenchanted teenager who navigates the complexities of adolescence in 1950s New York City after being expelled from his prep school. Through his cynical perspective, the novel explores themes of alienation, identity, and the painful transition into adulthood."
  },
  {
    "title": "Nineteen Eighty Four",
    "author": "George Orwell",
    "category": "800 Literature",
    "genre": "Dystopian",
    "description": "\"Nineteen Eighty-Four\" by George Orwell is a dystopian novel that explores a totalitarian regime characterized by pervasive surveillance, oppressive government control, and the manipulation of truth. It follows the life of Winston Smith, who struggles against the Party’s oppressive ideology and seeks to reclaim his individuality and freedom in a world where independent thought is punishable."
  },
  {
    "title": "Lolita",
    "author": "Vladimir Nabokov",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"Lolita,\" a novel by Vladimir Nabokov, tells the controversial story of Humbert Humbert, a middle-aged literature professor who becomes infatuated with a 12-year-old girl named Dolores Haze, whom he nicknames Lolita. Through Humbert's unreliable narration, the book explores themes of obsession, manipulation, and the complexities of longing, revealing the dark undercurrents of desire and morality."
  },
  {
    "title": "The Lord of the Rings",
    "author": "J. R. R. Tolkien",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "*The Lord of the Rings* by J.R.R. Tolkien is an epic high-fantasy novel that follows the quest of a diverse group of characters, including hobbits, elves, and men, as they seek to destroy a powerful ring that threatens their world. Set in the richly developed realm of Middle-earth, the story explores themes of friendship, sacrifice, and the struggle between good and evil."
  },
  {
    "title": "Moby-Dick",
    "author": "Herman Melville",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"Moby-Dick,\" written by Herman Melville, is a novel that follows the obsessive quest of Captain Ahab to seek revenge on the enormous white whale that took his leg, known as Moby Dick. Through the experiences of Ishmael, a sailor aboard Ahab's whaling ship, the narrative delves into themes of obsession, humanity's relationship with nature, and the struggle against fate."
  },
  {
    "title": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "To Kill a Mockingbird, written by Harper Lee, is a poignant novel set in the racially charged American South during the 1930s, seen through the eyes of young Scout Finch. The story explores themes of morality, justice, and empathy as Scout's father, Atticus Finch, defends an innocent Black man accused of raping a white woman, challenging societal norms and highlighting the deep-seated prejudices of their community."
  },
  {
    "title": "Anna Karenina",
    "author": "Leo Tolstoy",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Anna Karenina\" is a classic novel by Leo Tolstoy that explores the complexities of love and infidelity through the tragic story of Anna, a married woman who embarks on a passionate affair with the dashing Count Vronsky. Set against the backdrop of 19th-century Russia, the novel delves into themes of societal norms, moral dilemmas, and the search for genuine happiness."
  },
  {
    "title": "Don Quixote",
    "author": "Miguel de Cervantes",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Don Quixote,\" written by Miguel de Cervantes, is a classic novel that follows the adventures of an aging nobleman who, influenced by chivalric romances, sets out to revive knighthood and seek glory as a wandering knight. Accompanied by his loyal squire, Sancho Panza, Don Quixote's misguided quests lead to both comical and poignant encounters, exploring themes of reality versus illusion, individuality, and the nature of heroism."
  },
  {
    "title": "War and Peace",
    "author": "Leo Tolstoy",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"War and Peace\" by Leo Tolstoy is an epic novel set against the backdrop of the Napoleonic Wars, exploring the lives of several Russian aristocratic families. Through its intricate tapestry of characters and historical events, the book delves into themes of love, fate, and the impact of war on society and individual destinies."
  },
  {
    "title": "Pride and Prejudice",
    "author": "Jane Austen",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Pride and Prejudice\" by Jane Austen is a romantic novel that explores the themes of love, social class, and the role of women in early 19th-century England. Through the evolving relationship between the spirited Elizabeth Bennet and the wealthy yet aloof Mr. Darcy, the story delves into the challenges of overcoming personal prejudices and societal expectations."
  },
  {
    "title": "Wuthering Heights",
    "author": "Emily Brontë",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Wuthering Heights,\" by Emily Brontë, is a tale of intense passion and revenge set on the Yorkshire moors, centered around the tumultuous relationship between Heathcliff and Catherine Earnshaw. The novel explores themes of love, social class, and the destructive power of obsession across generations, revealing the dark complexities of human emotion."
  },
  {
    "title": "Crime and Punishment",
    "author": "Fyodor Dostoevsky",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"Crime and Punishment\" by Fyodor Dostoevsky follows the mental and moral struggles of Rodion Raskolnikov, a former student living in St. Petersburg who commits a murder believing he can justify his actions for a greater good. The novel delves into themes of guilt, redemption, and the psychological turmoil that arises from transgressing moral boundaries."
  },
  {
    "title": "The Sound and the Fury",
    "author": "William Faulkner",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Sound and the Fury\" by William Faulkner explores the decline of the Compson family, delving into themes of time, memory, and the complexities of human experience through innovative narrative techniques. The novel is structured in four distinct sections, each presenting a different perspective, with the first narrated by Benjy, a mentally challenged boy, highlighting the fragmented nature of perception and reality."
  },
  {
    "title": "The Stranger",
    "author": "Albert Camus",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"The Stranger\" by Albert Camus follows Meursault, an emotionally detached Algerian man whose indifferent reaction to his mother's death sets off a chain of events that culminate in a murder trial. The novel explores themes of absurdism and the complexities of human existence, as Meursault grapples with societal expectations and the meaninglessness of life."
  },
  {
    "title": "Madame Bovary",
    "author": "Gustave Flaubert",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Madame Bovary\" by Gustave Flaubert is a critical exploration of the life of Emma Bovary, a young woman whose quest for romance and luxury leads her to despair and moral downfall. The novel delves into themes of societal expectation, the constraints of marriage, and the pursuit of unattainable dreams, ultimately illustrating the tragic consequences of disillusionment."
  },
  {
    "title": "The Brothers Karamazov",
    "author": "Fyodor Dostoevsky",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"The Brothers Karamazov\" is a philosophical novel that delves into profound questions of faith, morality, and free will through the lives of the Karamazov brothers: Dmitri, Ivan, and Alyosha. As they grapple with familial conflict and the existence of God, the narrative explores the complexities of human nature and the struggle between good and evil."
  },
  {
    "title": "The Odyssey",
    "author": "Homer",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"The Odyssey\" by Homer is an epic poem that narrates the adventures of Odysseus as he attempts to return home to Ithaca after the Trojan War. Throughout his journey, he faces numerous challenges, including mythical creatures and divine interventions, while also exploring themes of loyalty, perseverance, and the longing for home."
  },
  {
    "title": "The Trial",
    "author": "Franz Kafka",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"The Trial\" by Franz Kafka is a surreal and unsettling novel that follows the story of Joseph K., a man arrested and prosecuted by an inaccessible authority for an unspecified crime. As he navigates a labyrinthine legal system, Kafka explores themes of alienation, existential anxiety, and the absurdity of modern life."
  },
  {
    "title": "To the Lighthouse",
    "author": "Virginia Woolf",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"To the Lighthouse\" is a modernist novel by Virginia Woolf that explores themes of consciousness, time, and the complexities of human relationships through the story of the Ramsay family and their visits to the Isle of Skye in Scotland. The narrative shifts between various characters' perspectives, particularly focusing on Mrs. Ramsay's nurturing spirit and her son, Cam, as they grapple with loss and the passage of time."
  },
  {
    "title": "Heart of Darkness",
    "author": "Joseph Conrad",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Heart of Darkness\" by Joseph Conrad follows the journey of Charles Marlow as he travels up the Congo River in search of the enigmatic Kurtz, a ivory trader who becomes a symbol of European colonialism's brutal impact in Africa. The novella explores themes of imperialism, civilization versus savagery, and the darkness that resides within humanity."
  },
  {
    "title": "The Grapes of Wrath",
    "author": "John Steinbeck",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Grapes of Wrath\" by John Steinbeck follows the Joad family as they journey from Oklahoma to California during the Great Depression, seeking a better life after losing their farm. The novel explores themes of social injustice, resilience, and the struggles of migrant workers, highlighting the harsh realities of economic hardship and human dignity."
  },
  {
    "title": "The Bible",
    "author": "Unknown",
    "category": "800 Literature",
    "genre": "Mythological",
    "description": "The Bible is a collection of sacred texts central to Christianity and Judaism, encompassing various literary forms, including historical narratives, poetry, prophecy, and teachings. Written by multiple authors over centuries, it explores themes of faith, morality, and divine revelation, making it one of the most influential works in human history."
  },
  {
    "title": "Alice's Adventures in Wonderland",
    "author": "Lewis Carroll",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"Alice's Adventures in Wonderland\" by Lewis Carroll follows a young girl named Alice who falls through a rabbit hole into a whimsical and nonsensical world filled with peculiar characters and bizarre events. Throughout her journey, she encounters the Cheshire Cat, the Mad Hatter, and the Queen of Hearts, leading to a series of surreal adventures that challenge her perceptions of reality and logic."
  },
  {
    "title": "The Divine Comedy",
    "author": "Dante Alighieri",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Divine Comedy\" by Dante Alighieri is an epic poem that explores the soul's journey toward God, structured into three parts: Inferno, Purgatorio, and Paradiso. Through vivid allegorical imagery and encounters with historical and mythical figures, Dante navigates the realms of the afterlife, reflecting on themes of sin, redemption, and divine love."
  },
  {
    "title": "The Magic Mountain",
    "author": "Thomas Mann",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Magic Mountain\" by Thomas Mann is a philosophical novel set in a Swiss sanatorium, where the protagonist, Hans Castorp, encounters a diverse array of characters who challenge his views on life, time, and illness. Through its exploration of existential themes and the clash between progress and stagnation, the novel reflects the complexities of early 20th-century European thought."
  },
  {
    "title": "Middlemarch",
    "author": "George Eliot",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Middlemarch,\" a novel by George Eliot, intricately weaves the lives and ambitions of various characters in a small English town during the early 19th century. It explores themes of social change, marriage, idealism, and the struggle for personal fulfillment, offering a rich tapestry of human experience and moral complexity."
  },
  {
    "title": "Adventures of Huckleberry Finn",
    "author": "Mark Twain",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"Adventures of Huckleberry Finn\" follows the journey of a young boy named Huck as he escapes his restrictive life and embarks on a raft journey down the Mississippi River with a runaway slave named Jim. Through their adventures, Twain explores themes of friendship, morality, and the social injustices of pre-Civil War America."
  },
  {
    "title": "Mrs. Dalloway",
    "author": "Virginia Woolf",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Mrs. Dalloway\" by Virginia Woolf follows Clarissa Dalloway as she prepares for a glamorous party in post-World War I London. Through a stream-of-consciousness narrative, the novel explores themes of time, mental health, and the interconnectedness of individual experiences."
  },
  {
    "title": "Jane Eyre",
    "author": "Charlotte Brontë",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Jane Eyre\" by Charlotte Brontë tells the story of an orphaned girl who overcomes a harsh childhood to find love and independence. Through her experiences as a governess at Thornfield Hall, Jane navigates issues of class, gender, and morality while striving for self-respect and personal fulfillment."
  },
  {
    "title": "Catch-22",
    "author": "Joseph Heller",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"Catch-22\" by Joseph Heller is a satirical novel set during World War II that follows Captain John Yossarian, a U.S. Army Air Forces B-25 bombardier, who is desperate to escape the absurdities of war. The story explores the bureaucratic paradox of \"Catch-22,\" a rule that prevents soldiers from avoiding dangerous missions, highlighting the illogical nature of military life and the struggle for sanity in an insane world."
  },
  {
    "title": "Great Expectations",
    "author": "Charles Dickens",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Great Expectations\" is a coming-of-age novel by Charles Dickens that follows the life of an orphan named Pip, who aspires to rise above his humble beginnings through ambition and the influence of mysterious benefactors. As he navigates love, social class, and personal growth, Pip learns valuable lessons about wealth, friendship, and the true nature of greatness."
  },
  {
    "title": "The Iliad",
    "author": "Homer",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Iliad,\" attributed to Homer, is an ancient Greek epic poem that explores the themes of heroism, honor, and the tragic consequences of war during the Trojan War. The narrative primarily follows the Greek warrior Achilles as he grapples with personal conflict, rage, and the fate of his comrades in the face of impending doom."
  },
  {
    "title": "The Master and Margarita",
    "author": "Mikhail Bulgakov",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Master and Margarita\" by Mikhail Bulgakov is a satirical novel that weaves together the story of the Devil visiting Soviet Moscow with a retelling of the trial of Jesus in Jerusalem. Through its fantastical elements and biting commentary on society, the book explores themes of love, fate, and the nature of good and evil."
  },
  {
    "title": "Invisible Man",
    "author": "Ralph Ellison",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Invisible Man\" by Ralph Ellison follows the journey of an unnamed African American protagonist who grapples with his identity and societal invisibility in a racially divided America. Through his experiences, the novel explores themes of race, individuality, and the quest for personal and social identity."
  },
  {
    "title": "Frankenstein",
    "author": "Mary Shelley",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Frankenstein,\" written by Mary Shelley, tells the story of Victor Frankenstein, a scientist who creates a sentient creature in an unorthodox experiment, only to be horrified by his own creation. As the creature seeks acceptance and grapples with its own identity, the novel explores themes of ambition, isolation, and the consequences of defying the natural order."
  },
  {
    "title": "The Sun Also Rises",
    "author": "Ernest Hemingway",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Sun Also Rises\" by Ernest Hemingway follows a group of expatriates in the 1920s as they navigate the disillusionment and moral ambiguity of the post-World War I era. Centered around the protagonist Jake Barnes and his unrequited love for the fiercely independent Lady Brett Ashley, the novel captures their journey through Paris and Spain, exploring themes of identity, love, and the complexities of modern life."
  },
  {
    "title": "Les Misérables",
    "author": "Victor Hugo",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Les Misérables\" by Victor Hugo is a sweeping tale of redemption and love set against the backdrop of 19th-century France. It follows the life of ex-convict Jean Valjean as he seeks to escape his past and make amends, intertwining the stories of various characters struggling with poverty, injustice, and the quest for a better life."
  },
  {
    "title": "On the Road",
    "author": "Jack Kerouac",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"On the Road\" by Jack Kerouac is a seminal work of American literature that chronicles the spontaneous journeys of the author and his friends across the United States in the late 1940s. Through a vibrant exploration of freedom, friendship, and the search for meaning, the novel captures the essence of the Beat Generation and the desire to break away from societal norms."
  },
  {
    "title": "Absalom, Absalom!",
    "author": "William Faulkner",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Absalom, Absalom!\" by William Faulkner is a Southern Gothic novel that explores the tumultuous life of Thomas Sutpen, a plantation owner in Mississippi, and the impact of his ambitions on his family and society. Through a complex narrative structure and multiple perspectives, Faulkner delves into themes of race, history, and the destructive nature of the past."
  },
  {
    "title": "Midnight's Children",
    "author": "Salman Rushdie",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Midnight's Children\" by Salman Rushdie is a magical realism novel that follows the life of Saleem Sinai, who is born at the exact moment of India’s independence in 1947. The story intertwines his personal narrative with the historical upheavals of the nation, exploring themes of identity, cultural heritage, and the impact of destiny."
  },
  {
    "title": "Things Fall Apart",
    "author": "Chinua Achebe",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Things Fall Apart\" by Chinua Achebe is a poignant exploration of Igbo culture and the deep-rooted traditions of a Nigerian village facing the disruptive forces of colonialism and Christianity in the late 19th century. Through the tragic story of Okonkwo, a proud and ambitious warrior, Achebe illustrates the complexities of identity, masculinity, and the clash between tradition and change."
  },
  {
    "title": "The Little Prince",
    "author": "Antoine de Saint-Exupéry",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Little Prince\" by Antoine de Saint-Exupéry is a whimsical tale that follows a young prince who travels from his home asteroid to various planets, where he meets peculiar inhabitants that teach him profound lessons about love, friendship, and the nature of human relationships. Through its charming narrative and insightful illustrations, the book encourages readers to view the world through the eyes of a child and to cherish the important things in life that are often overlooked by adults."
  },
  {
    "title": "Beloved",
    "author": "Toni Morrison",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Beloved\" by Toni Morrison tells the haunting story of Sethe, an escaped slave, who is confronted by her traumatic past and the ghost of her deceased daughter. The novel explores themes of memory, motherhood, and the legacy of slavery, highlighting the deep psychological scars that shape the characters' lives."
  },
  {
    "title": "Journey to the End of The Night",
    "author": "Louis-Ferdinand Céline",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Journey to the End of the Night\" by Louis-Ferdinand Céline is a groundbreaking modernist novel that follows the life of Ferdinand Bardamu, a disillusioned soldier and doctor who navigates the horrors of World War I and the bleakness of human existence. Through its innovative narrative style and stark critique of society, the book explores themes of alienation, suffering, and the absurdity of life."
  },
  {
    "title": "The Red and the Black",
    "author": "Stendhal",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Red and the Black\" by Stendhal follows the ambitious young man Julien Sorel as he navigates the rigid social structures of 19th-century France, driven by his desire for power and love. Through his passionate pursuits, the novel explores themes of social ambition, hypocrisy, and the conflict between personal desires and societal constraints."
  },
  {
    "title": "Fictions",
    "author": "Jorge Luis Borges",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Fictions\" by Jorge Luis Borges is a groundbreaking collection of short stories that explores complex themes such as time, identity, and the nature of reality. Through intricate narratives and philosophical musings, Borges challenges readers to reconsider perceptions of existence and the infinite possibilities of storytelling."
  },
  {
    "title": "David Copperfield",
    "author": "Charles Dickens",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"David Copperfield\" is a semi-autobiographical novel by Charles Dickens that follows the life and experiences of its titular character from childhood to adulthood. As David navigates a series of personal and social challenges, the story explores themes of resilience, identity, and the effects of class and poverty in Victorian England."
  },
  {
    "title": "Brave New World",
    "author": "Aldous Huxley",
    "category": "800 Literature",
    "genre": "Dystopian",
    "description": "\"Brave New World\" by Aldous Huxley is a dystopian novel set in a technologically advanced future where society is engineered for efficiency and conformity, sacrificing individuality and emotions. The story follows characters who grapple with the oppressive societal norms and the consequences of a life devoid of personal freedom and genuine connections."
  },
  {
    "title": "Animal Farm",
    "author": "George Orwell",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Animal Farm\" by George Orwell is an allegorical novella that satirizes totalitarianism through the story of a group of farm animals who revolt against their human farmer, only to find themselves under the oppressive rule of their own kind. The narrative explores themes of power, corruption, and the betrayal of revolutionary ideals, illustrating how a quest for equality can lead to the emergence of a new tyranny."
  },
  {
    "title": "The Old Man and the Sea",
    "author": "Ernest Hemingway",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Old Man and the Sea\" is a poignant novella by Ernest Hemingway that tells the story of Santiago, an aging fisherman who embarks on an epic struggle to catch a giant marlin off the coast of Cuba. Through his relentless battle with nature, the narrative explores themes of perseverance, dignity, and the indomitable human spirit."
  },
  {
    "title": "The Life And Opinions Of Tristram Shandy",
    "author": "Laurence Sterne",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "\"The Life and Opinions of Tristram Shandy, Gentleman\" by Laurence Sterne is a groundbreaking and unconventional novel that explores the life of its titular character, Tristram Shandy, through a series of humorous digressions and tangential narratives. With its playful structure and witty prose, the book challenges traditional storytelling conventions and delves into themes of identity, time, and the nature of consciousness."
  },
  {
    "title": "The Diary of a Young Girl",
    "author": "Anne Frank",
    "category": "800 Literature",
    "genre": "Banned books",
    "description": "\"The Diary of a Young Girl\" by Anne Frank is a poignant first-person account of a Jewish girl’s experiences hiding from the Nazis during World War II. Through her diary entries, Anne captures her thoughts, fears, and hopes, offering a powerful insight into the human spirit amidst the horrors of war and persecution."
  },
  {
    "title": "Little Women",
    "author": "Louisa May Alcott",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Little Women\" by Louisa May Alcott chronicles the lives of the four March sisters—Meg, Jo, Beth, and Amy—as they navigate the challenges of growing up during the 19th century in New England. The novel explores themes of family, love, and individual aspirations, capturing the sisters' journeys from childhood to adulthood as they each pursue their dreams while supporting one another."
  },
  {
    "title": "Hamlet",
    "author": "William Shakespeare",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Hamlet,\" a tragedy by William Shakespeare, revolves around Prince Hamlet's quest for revenge against his uncle Claudius, who has murdered Hamlet’s father, taken the throne, and married Hamlet’s mother. The play explores themes of madness, morality, and the complexities of action and inaction, culminating in a dramatic and tragic conclusion."
  },
  {
    "title": "Their Eyes Were Watching God",
    "author": "Zora Neale Hurston",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "Their Eyes Were Watching God follows the life of Janie Crawford, an African American woman in the early 20th century, as she embarks on a journey of self-discovery and empowerment through her experiences with love, loss, and independence. The novel explores themes of racial identity, gender roles, and the search for true happiness against the backdrop of Southern life."
  },
  {
    "title": "Rebecca",
    "author": "Daphne du Maurier",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Rebecca\" by Daphne du Maurier is a gothic novel that follows an unnamed young woman who becomes the second wife of the wealthy widower Maxim de Winter, only to find herself overshadowed by the lingering presence of his first wife, Rebecca. As she navigates the eerie atmosphere of Manderley, the couple's estate, the protagonist grapples with jealousy, insecurity, and the haunting secrets that Rebecca's legacy holds over their lives."
  },
  {
    "title": "Gone With the Wind",
    "author": "Margaret Mitchell",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Gone With the Wind,\" written by Margaret Mitchell, is a sweeping historical novel that follows the life of Scarlett O'Hara, a headstrong Southern belle, during the tumult of the American Civil War and Reconstruction era. As she navigates love, loss, and the harsh realities of a changing world, Scarlett's resilience and determination reflect the complexities of her character and the South's shifting landscape."
  },
  {
    "title": "Gulliver's Travels",
    "author": "Jonathan Swift",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"Gulliver's Travels\" by Jonathan Swift is a satirical novel that follows Lemuel Gulliver, a shipwrecked surgeon who embarks on a series of fantastical journeys to strange lands inhabited by peculiar creatures. Through his adventures, Swift critiques human nature, societal norms, and political institutions, using absurdity to highlight the follies and vices of mankind."
  },
  {
    "title": "Slaughterhouse-Five",
    "author": "Kurt Vonnegut",
    "category": "800 Literature",
    "genre": "Dark",
    "description": "\"Slaughterhouse-Five\" by Kurt Vonnegut is a satirical novel that follows the experiences of Billy Pilgrim, a World War II soldier who becomes \"unstuck in time,\" experiencing moments of his life out of sequence, including his time as a prisoner of war during the bombing of Dresden. The book explores themes of free will, the absurdity of war, and the nature of existence through a blend of science fiction and dark humor."
  },
  {
    "title": "A Passage to India",
    "author": "E. M. Forster",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"A Passage to India\" by E. M. Forster explores the complex dynamics between British colonizers and Indian citizens in colonial India, centering around the friendship between an Indian doctor, Dr. Aziz, and a British woman, Adela Quested. The novel delves into themes of cultural misunderstanding, racial tension, and the struggle for connection amidst the divisions of colonialism."
  },
  {
    "title": "Lord of the Flies",
    "author": "William Golding",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Lord of the Flies\" by William Golding is a compelling novel that explores the descent into savagery of a group of boys stranded on an uninhabited island. As they struggle for survival, their inherent instincts and societal norms unravel, revealing the darkness within human nature."
  },
  {
    "title": "Candide",
    "author": "Voltaire",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Candide\" by Voltaire is a satirical novel that follows the misadventures of its optimistic protagonist, Candide, as he navigates a series of misfortunes and absurdities in his quest for happiness and knowledge. Through sharp wit and irony, Voltaire critiques optimism, societal norms, and the harsh realities of life, ultimately suggesting that contentment can be found in accepting one's circumstances rather than seeking an unattainable ideal."
  },
  {
    "title": "Dune",
    "author": "Frank Herbert",
    "category": "800 Literature",
    "genre": "Fantasy",
    "description": "\"Dune\" by Frank Herbert is a science fiction epic set on the desert planet of Arrakis, where the valuable spice melange is mined. The story follows young Paul Atreides as he navigates political intrigue, environmental challenges, and his destiny as a potential messianic figure in a battle for control of the universe."
  },
  {
    "title": "The Aeneid",
    "author": "Virgil",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Aeneid\" by Virgil is an epic poem that follows the journey of Aeneas, a Trojan hero destined to found Rome after fleeing the destruction of Troy. Through trials and divine interventions, the narrative explores themes of duty, fate, and the struggle between personal desire and destiny as Aeneas embodies the virtues of leadership and resilience."
  },
  {
    "title": "The Handmaid's Tale",
    "author": "Margaret Atwood",
    "category": "800 Literature",
    "genre": "Dystopian",
    "description": "\"The Handmaid's Tale\" by Margaret Atwood is a dystopian novel set in a totalitarian society called Gilead, where women are subjugated and stripped of their rights. The story follows Offred, a Handmaid forced to bear children for the ruling elite, as she navigates the oppressive regime and yearns for freedom and autonomy."
  },
  {
    "title": "Leaves of Grass",
    "author": "Walt Whitman",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Leaves of Grass\" by Walt Whitman is a seminal collection of poetry that celebrates the beauty of nature, the human experience, and the interconnectedness of all life. Through innovative free verse and a deeply personal voice, Whitman explores themes of individuality, democracy, and the transcendence of the soul."
  },
  {
    "title": "The Good Soldier",
    "author": "Ford Madox Ford",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Good Soldier\" by Ford Madox Ford is a poignant exploration of love, betrayal, and the complexities of human relationships, centered around the lives of two couples vacationing together in Europe. Through the fragmented narratives of their intertwined lives, the novel delves into themes of deception and the moral ambiguities of its characters, ultimately revealing the darker sides of their seemingly idyllic existence."
  },
  {
    "title": "The Leopard",
    "author": "Giuseppe Tomasi di Lampedusa",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Leopard\" by Giuseppe Tomasi di Lampedusa chronicles the decline of the Sicilian aristocracy during the unification of Italy in the 19th century through the eyes of Prince Fabrizio Salina. The novel explores themes of change, identity, and resilience as the prince navigates the shifting political landscape and reflects on the inevitable passage of time."
  },
  {
    "title": "Orlando",
    "author": "Virginia Woolf",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Orlando\" by Virginia Woolf is a novel that tells the story of an androgynous character who undergoes a remarkable transformation, living for centuries and experiencing life across different eras and societal norms. Through this fantastical journey, Woolf explores themes of gender, identity, and the fluidity of self, challenging traditional notions of time and existence."
  },
  {
    "title": "The Portrait of a Lady",
    "author": "Henry James",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Portrait of a Lady\" by Henry James follows Isabel Archer, a spirited American woman who navigates the complexities of life and love in Europe after inheriting a fortune. As she encounters various suitors and experiences the constraints of societal expectations, Isabel's quest for independence and self-discovery leads to profound personal dilemmas."
  },
  {
    "title": "The Golden Notebook",
    "author": "Doris May Lessing",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Golden Notebook\" by Doris Lessing explores the fragmented life of a writer named Anna Wulf, who struggles to reconcile her personal experiences with her political beliefs and societal roles in post-war society. Through the use of multiple notebooks, each representing different aspects of her identity, Lessing delves into themes of mental illness, feminism, and the search for coherence in a chaotic world."
  },
  {
    "title": "Essays",
    "author": "Michel de Montaigne",
    "category": "300 Social Sciences",
    "genre": "Cultural",
    "description": "\"Essays\" by Michel de Montaigne is a foundational work in the genre of personal essay, where Montaigne explores a wide range of topics including philosophy, human behavior, and morality through introspective and anecdotal reflections. His unique blend of personal narrative and critical thought invites readers to consider the complexities of the human experience and the nature of self-knowledge."
  },
  {
    "title": "Dracula",
    "author": "Bram Stoker",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Dracula,\" written by Bram Stoker and published in 1897, follows the harrowing journey of Jonathan Harker as he confronts the enigmatic Count Dracula, a centuries-old vampire. The novel explores themes of love, fear, and the clash between modernity and ancient evil, as characters band together to thwart Dracula's nefarious plans in Victorian England."
  },
  {
    "title": "Oedipus the King",
    "author": "Sophocles",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Oedipus the King,\" a tragedy by Sophocles, narrates the harrowing journey of Oedipus, the King of Thebes, as he seeks to uncover the truth behind a plague afflicting his city. Unbeknownst to him, his quest leads to a devastating revelation about his own identity and the fulfillment of a prophecy that foretold he would murder his father and marry his mother."
  },
  {
    "title": "The Idiot",
    "author": "Fyodor Dostoevsky",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Idiot\" by Fyodor Dostoevsky tells the story of Prince Lev Nikolayevich Myshkin, a compassionate and naive man whose honesty and innocence lead him into a complex web of love, betrayal, and societal criticism. As he navigates the contrasting moralities of 19th-century Russian society, Myshkin's encounters reveal the depths of human nature and the struggles between idealism and reality."
  },
  {
    "title": "The Castle",
    "author": "Franz Kafka",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Castle\" by Franz Kafka follows the story of K. as he arrives in a remote village to assume a mysterious land surveying position, only to find himself entangled in an absurd and bureaucratic struggle against the bureaucratic forces of the castle. Through K.'s futile attempts to gain access to the castle and understand its workings, the novel explores themes of alienation, the search for meaning, and the nature of authority."
  },
  {
    "title": "In Cold Blood",
    "author": "Truman Capote",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"In Cold Blood\" by Truman Capote is a groundbreaking nonfiction novel that explores the brutal 1959 murder of the Clutter family in Holcomb, Kansas. Through meticulous research and vivid storytelling, Capote delves into the psychology of the killers and the impact of the crime on the small community, blending elements of true crime with literary artistry."
  },
  {
    "title": "The Metamorphosis",
    "author": "Franz Kafka",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Metamorphosis\" by Franz Kafka tells the surreal tale of Gregor Samsa, who awakens one morning to find himself transformed into a giant insect. As he grapples with his new physical form, Gregor's struggle for acceptance highlights themes of alienation and the burdens of familial responsibility."
  },
  {
    "title": "Buddenbrooks",
    "author": "Thomas Mann",
    "category": "800 Literature",
    "genre": "Family & Relationships",
    "description": "\"Buddenbrooks\" by Thomas Mann is a family saga that chronicles the decline of a wealthy merchant family in Lübeck, Germany, over several generations. Through the struggles of its characters, the novel explores themes of social change, personal ambition, and the clash between tradition and modernity."
  },
  {
    "title": "The Picture of Dorian Gray",
    "author": "Oscar Wilde",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Picture of Dorian Gray\" by Oscar Wilde tells the story of a young man named Dorian Gray, whose portrait ages and reflects the corruption of his soul while he remains outwardly youthful and handsome. As Dorian indulges in a life of excess and hedonism, he grapples with the consequences of his choices and the moral decay that accompanies his pursuit of beauty and pleasure."
  },
  {
    "title": "All Quiet on the Western Front",
    "author": "Erich Maria Remarque",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"All Quiet on the Western Front\" by Erich Maria Remarque is a poignant novel that explores the harrowing experiences of World War I through the eyes of a young German soldier, Paul Bäumer. It vividly depicts the brutal realities of war, the loss of innocence, and the profound disillusionment felt by those who survived the battlefield."
  },
  {
    "title": "The Age of Innocence",
    "author": "Edith Wharton",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"The Age of Innocence\" by Edith Wharton explores the social mores and constraints of high society in 19th-century New York City, focusing on the intricate relationships between its characters. Through the story of Newland Archer, who is torn between his duty to marry the conventional May Welland and his passion for the unconventional Ellen Olenska, the novel critiques the hypocrisy and limitations of societal expectations."
  },
  {
    "title": "The Count of Monte Cristo",
    "author": "Alexandre Dumas",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"The Count of Monte Cristo\" by Alexandre Dumas follows the story of Edmond Dantès, a wrongfully imprisoned sailor who seeks vengeance against those who betrayed him. After discovering a hidden treasure on the Isle of Monte Cristo, he transforms into the wealthy Count of Monte Cristo, using his newfound power to orchestrate elaborate retribution against his enemies while exploring themes of justice, forgiveness, and redemption."
  },
  {
    "title": "A Portrait of the Artist as a Young Man",
    "author": "James Joyce",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"A Portrait of the Artist as a Young Man\" is a semi-autobiographical novel by James Joyce that follows the early life of Stephen Dedalus, a young man grappling with his identity and the constraints of Irish society and Catholicism. Through a stream-of-consciousness narrative, Joyce explores themes of individuality, artistic expression, and the complexities of coming of age."
  },
  {
    "title": "Faust",
    "author": "Johann Wolfgang von Goethe",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Faust\" by Johann Wolfgang von Goethe is a tragic play that explores the themes of ambition, desire, and the quest for meaning through the story of Dr. Faust, a scholar who makes a pact with the devil, Mephistopheles, in exchange for knowledge and worldly pleasures. The narrative delves into profound philosophical questions and the struggle between good and evil, ultimately questioning the nature of salvation and fulfillment."
  },
  {
    "title": "Under the Volcano",
    "author": "Malcolm Lowry",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Under the Volcano\" by Malcolm Lowry is a poignant and immersive novel that follows an English consul, Geoffrey Firmin, as he spirals into despair and alcoholism in a small Mexican town on the Day of the Dead. The narrative intricately weaves themes of love, loss, and existential struggle against the backdrop of political turmoil and cultural dislocation."
  },
  {
    "title": "As I Lay Dying",
    "author": "William Faulkner",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"As I Lay Dying\" by William Faulkner is a groundbreaking Southern Gothic novel that narrates the journey of the Bundren family as they travel to fulfill the dying wish of matriarch Addie Bundren, who desires to be buried in her hometown. Told through multiple perspectives, the novel explores themes of mortality, identity, and the complexities of familial relationships amidst the backdrop of rural Mississippi."
  },
  {
    "title": "The Scarlet Letter",
    "author": "Nathaniel Hawthorne",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Scarlet Letter\" by Nathaniel Hawthorne explores themes of sin, guilt, and societal judgment through the story of Hester Prynne, a woman in 17th-century Puritan Massachusetts who bears an illegitimate child and is publicly shamed. As she grapples with her past and the consequences of her actions, Hester's defiance and resilience ultimately challenge the moral rigidity of her community."
  },
  {
    "title": "Emma",
    "author": "Jane Austen",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Emma\" by Jane Austen follows the story of Emma Woodhouse, a spirited and self-assured young woman who fancies herself a matchmaker. As she navigates her social circle in the quaint village of Highbury, her misguided attempts at romance lead to humorous misunderstandings and self-discovery, ultimately teaching her valuable lessons about love and humility."
  },
  {
    "title": "Silent Spring",
    "author": "Rachel Carson",
    "category": "800 Literature",
    "genre": "Nonfiction",
    "description": "\"Silent Spring\" by Rachel Carson is a groundbreaking work that examines the detrimental effects of pesticides on the environment, particularly focusing on the impacts of chemical spraying on wildlife and ecosystems. Published in 1962, the book sparked an environmental movement and raised public awareness about the interconnectedness of all living organisms and the need for sustainable practices."
  },
  {
    "title": "Pale Fire",
    "author": "Vladimir Nabokov",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "\"Pale Fire\" by Vladimir Nabokov is a uniquely structured novel presented as a poem written by a fictional poet, John Shade, accompanied by an extensive commentary by his obsessive and unreliable neighbor, Charles Kinbote. The book explores themes of art, identity, and the nature of reality, blurring the lines between author, narrator, and reader through its intricate narrative and metafictional elements."
  },
  {
    "title": "Charlotte's Web",
    "author": "E. B. White",
    "category": "800 Literature",
    "genre": "Children's books",
    "description": "\"Charlotte's Web\" by E.B. White is a heartwarming tale of friendship between a pig named Wilbur and a clever spider named Charlotte, who devises a plan to save him from slaughter. Through their bond and Charlotte's extraordinary web-spinning talent, the story explores themes of loyalty, sacrifice, and the beauty of life."
  },
  {
    "title": "Demons",
    "author": "Fyodor Dostoevsky",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Demons,\" also known as \"The Possessed\" or \"Devils,\" is a psychological and political novel by Fyodor Dostoevsky that explores the destructive influence of radical ideologies on individuals and society. Through a gripping narrative involving a group of young intellectuals in 19th-century Russia, the book examines themes of nihilism, morality, and the nature of evil, revealing the chaos that ensues when belief systems break down."
  },
  {
    "title": "Robinson Crusoe",
    "author": "Daniel Defoe",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"Robinson Crusoe\" by Daniel Defoe tells the story of a young man who becomes shipwrecked on a deserted island and must use his ingenuity and resourcefulness to survive alone for 28 years. Throughout his isolation, Crusoe grapples with loneliness, faith, and the struggle for human connection, ultimately finding solace in his relationship with the island and a native man he rescues, whom he names Friday."
  },
  {
    "title": "The Bell Jar",
    "author": "Sylvia Plath",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Bell Jar\" is a semi-autobiographical novel that follows Esther Greenwood, a young woman struggling with mental illness and societal expectations in 1950s America. Through her descent into depression and feelings of alienation, Plath explores themes of identity, gender roles, and the search for self-acceptance."
  },
  {
    "title": "Waiting for Godot",
    "author": "Samuel Beckett",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"Waiting for Godot\" by Samuel Beckett is a tragicomedy that explores the themes of existentialism and the human condition through the encounters of two characters, Vladimir and Estragon, who wait indefinitely for someone named Godot. As they engage in absurd conversations and face the uncertainty of their situation, the play delves into the futility of waiting and the search for meaning in an indifferent universe."
  },
  {
    "title": "The Complete Tales and Poems of Edgar Allan Poe",
    "author": "Edgar Allan Poe",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Complete Tales and Poems of Edgar Allan Poe\" compiles the enigmatic and macabre works of Edgar Allan Poe, showcasing his mastery in gothic storytelling and innovative poetry. This comprehensive collection includes notable pieces such as \"The Raven,\" \"The Tell-Tale Heart,\" and \"The Fall of the House of Usher,\" reflecting themes of death, madness, and the supernatural."
  },
  {
    "title": "The Plague",
    "author": "Albert Camus",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Plague\" by Albert Camus is a profound allegorical novel that explores human resilience and the struggle against suffering through the lens of a fictional outbreak of bubonic plague in the Algerian town of Oran. As the townspeople grapple with isolation, fear, and the moral questions raised by the crisis, the narrative delves into themes of solidarity, absurdity, and the human condition."
  },
  {
    "title": "Native Son",
    "author": "Richard Wright",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Native Son\" by Richard Wright tells the harrowing story of Bigger Thomas, a young African American man living in 1930s Chicago, who grapples with systemic racism, poverty, and personal despair. The novel explores themes of oppression, identity, and the consequences of societal expectations, ultimately leading to a tragic and thought-provoking conclusion."
  },
  {
    "title": "Vanity Fair",
    "author": "William Makepeace Thackeray",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Vanity Fair\" by William Makepeace Thackeray is a satirical novel that chronicles the lives and ambitions of two women, Becky Sharp and Amelia Sedley, against the backdrop of early 19th-century British society. Through its vivid characters and sharp commentary on social class and morality, the book critiques the pursuit of wealth and status in a world driven by vanity and greed."
  },
  {
    "title": "The Stories of Anton Chekhov",
    "author": "Anton Chekhov",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"The Stories of Anton Chekhov\" is a compelling collection of short stories that showcases the masterful storytelling and keen psychological insight of the renowned Russian writer. Through his vivid characters and intricate plots, Chekhov explores the complexities of human nature, societal norms, and the often-painful realities of life."
  },
  {
    "title": "The Color Purple",
    "author": "Alice Walker",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Color Purple\" by Alice Walker is a powerful novel that follows the life of Celie, an African American woman in the early 20th century American South, who endures abuse, racism, and sexism. Through letters to God and her sister, she ultimately discovers her voice, resilience, and the transformative power of love and sisterhood."
  },
  {
    "title": "Walden",
    "author": "Henry David Thoreau",
    "category": "800 Literature",
    "genre": "Nonfiction",
    "description": "\"Walden\" by Henry David Thoreau is a reflection on simple living in natural surroundings, drawn from his experiment of spending two years in a small cabin near Walden Pond in Massachusetts. Through his observations and philosophical musings, Thoreau emphasizes the importance of self-sufficiency, the beauty of nature, and the critique of materialism in modern society."
  },
  {
    "title": "The Man Without Qualities",
    "author": "Robert Musil",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Man Without Qualities\" by Robert Musil is a philosophical novel that explores the life of Ulrich, a disenchanted intellectual in early 20th-century Vienna, as he navigates the complexities of modern society. Through Ulrich's introspective journey, the book examines themes of identity, morality, and the nature of existence against the backdrop of a world on the brink of World War I."
  },
  {
    "title": "Treasure Island",
    "author": "Robert Louis Stevenson",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"Treasure Island\" by Robert Louis Stevenson is a classic adventure novel that follows young Jim Hawkins as he embarks on a perilous quest for buried pirate treasure. The story features a cast of memorable characters, including the charismatic yet enigmatic Long John Silver, as they navigate treachery and mutiny on the high seas."
  },
  {
    "title": "The Long Goodbye",
    "author": "Raymond Chandler",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"The Long Goodbye\" by Raymond Chandler follows private detective Philip Marlowe as he navigates a complex web of friendship, betrayal, and murder while investigating the mysterious circumstances surrounding his friend Terry Lennox. Set against the backdrop of 1950s Los Angeles, the novel delves into themes of loyalty and the darker side of human nature, showcasing Chandler's signature hard-boiled noir style."
  },
  {
    "title": "The Tin Drum",
    "author": "Günter Grass",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Tin Drum,\" written by Günter Grass, follows the life of Oskar Matzerath, a boy who decides to stop growing at the age of three as a form of rebellion against the adult world's chaos and the rise of Nazism in Germany. Through his unique perspective and his cherished tin drum, Oskar narrates a darkly humorous yet poignant tale that explores themes of innocence, consciousness, and the complexities of history."
  },
  {
    "title": "The Second Sex",
    "author": "Simone de Beauvoir",
    "category": "800 Literature",
    "genre": "Mythological",
    "description": "*The Second Sex* by Simone de Beauvoir is a foundational feminist text that explores the ways in which women have been historically defined in relation to men and examines the social constructs of femininity. Through a philosophical lens, de Beauvoir argues for women's liberation and the necessity of recognizing women as autonomous beings, challenging the notions of gender and identity."
  },
  {
    "title": "The Hound of the Baskervilles",
    "author": "Arthur Conan Doyle",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"The Hound of the Baskervilles\" is a mystery novel featuring the iconic detective Sherlock Holmes as he investigates the mysterious death of Sir Charles Baskerville, who is believed to have been killed by a supernatural hound haunting the Baskerville family. Set on the eerie moors of Devonshire, the story combines elements of gothic horror with Holmes's trademark logic and deduction to unravel the truth behind the legend."
  },
  {
    "title": "Dead Souls",
    "author": "Nikolai Gogol",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Dead Souls\" by Nikolai Gogol is a satirical novel that follows the journey of Chichikov, a cynical landowner who seeks to acquire deceased serfs' names to exploit a loophole in the Russian estate system. Through this darkly humorous narrative, Gogol critiques the superficiality and moral failings of 19th-century Russian society."
  },
  {
    "title": "The Waste Land",
    "author": "T. S. Eliot",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "\"The Waste Land\" by T. S. Eliot is a seminal modernist poem that explores themes of disillusionment and fragmentation in the aftermath of World War I. Through a rich tapestry of allusions, diverse voices, and non-linear narratives, Eliot portrays a landscape of cultural desolation and the search for meaning in a chaotic world."
  },
  {
    "title": "The Talented Mr. Ripley",
    "author": "Patricia Highsmith",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"The Talented Mr. Ripley\" by Patricia Highsmith follows the life of Tom Ripley, a cunning and charismatic con artist who becomes envious of the luxurious lifestyle of wealthy expatriate Dickie Greenleaf. As Ripley manipulates and ultimately eliminates obstacles in his path, the novel explores themes of identity, obsession, and the moral ambiguities of his relentless pursuit of success and acceptance."
  },
  {
    "title": "The Wind in the Willows",
    "author": "Kenneth Grahame",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"The Wind in the Willows\" by Kenneth Grahame is a classic children's novel that follows the adventures of four animal friends — Mole, Ratty, Badger, and the impulsive Toad — as they explore the themes of friendship, nature, and the joys of life. Through their whimsical escapades, the story highlights the charm of the English countryside and the importance of home and belonging."
  },
  {
    "title": "Brideshead Revisited",
    "author": "Evelyn Waugh",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Brideshead Revisited\" by Evelyn Waugh is a poignant exploration of nostalgia, faith, and the complexities of friendship set against the backdrop of an English aristocratic family. Through the eyes of Charles Ryder, the narrative delves into themes of love and loss as he reflects on his connections with the Flyte family and their grand estate, Brideshead Castle, during the interwar period."
  },
  {
    "title": "The Big Sleep",
    "author": "Raymond Chandler",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"The Big Sleep\" is a hard-boiled detective novel featuring private investigator Philip Marlowe as he navigates the seedy underbelly of Los Angeles while investigating a case involving the wealthy Sternwood family. Packed with sharp dialogue, complex characters, and intricate plotting, the book explores themes of corruption, moral ambiguity, and the elusive nature of truth."
  },
  {
    "title": "Bleak House",
    "author": "Charles Dickens",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Bleak House\" by Charles Dickens follows the intertwined lives of numerous characters caught in the protracted and corrupt legal case of Jarndyce and Jarndyce, a reflection of the flaws in the Victorian justice system. Through its rich narrative, the novel critiques social injustices while exploring themes of poverty, love, and the complexities of human nature."
  },
  {
    "title": "A Farewell to Arms",
    "author": "Ernest Hemingway",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"A Farewell to Arms\" by Ernest Hemingway is a poignant novel set during World War I, depicting the love affair between an American ambulance driver, Frederick Henry, and a British nurse, Catherine Barkley. The narrative explores themes of love, loss, and the futility of war, ultimately reflecting on the impact of conflict on human relationships and individual desires."
  },
  {
    "title": "Antigone",
    "author": "Sophocles",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Antigone\" by Sophocles is a tragic play that explores the conflict between individual conscience and state law through the story of Antigone, who defies King Creon’s orders to honor her deceased brother with a proper burial. As she faces the consequences of her principles, the play examines themes of justice, loyalty, and the moral dilemmas inherent in authority."
  },
  {
    "title": "The Heart Is A Lonely Hunter",
    "author": "Carson McCullers",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Heart Is a Lonely Hunter\" by Carson McCullers explores the lives of several marginalized individuals in a small Southern town during the 1930s, each grappling with loneliness and the search for connection. Through the deeply introspective narrative, McCullers delves into themes of communication, isolation, and the human condition."
  },
  {
    "title": "The Maltese Falcon",
    "author": "Dashiell Hammett",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"The Maltese Falcon\" by Dashiell Hammett is a classic hard-boiled detective novel that follows private investigator Sam Spade as he becomes entangled in a web of deceit and danger while searching for a priceless artifact, the eponymous Maltese Falcon. The story explores themes of morality, greed, and betrayal, culminating in a suspenseful confrontation with a cast of dubious characters."
  },
  {
    "title": "Pedro Páramo",
    "author": "Juan Rulfo",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Pedro Páramo\" by Juan Rulfo is a haunting novel that follows Juan Preciado as he journeys to the ghostly town of Comala in search of his father, Pedro Páramo. Blending the realms of the living and the dead, the story reveals the tragic and oppressive legacy of Páramo's tyrannical rule, exploring themes of memory, loss, and the quest for identity in a world steeped in supernatural elements."
  },
  {
    "title": "A Clockwork Orange",
    "author": "Anthony Burgess",
    "category": "800 Literature",
    "genre": "Dark",
    "description": "\"A Clockwork Orange\" by Anthony Burgess is a dystopian novel that follows the violent escapades of Alex, a teenage delinquent in a future society where free will is suppressed. Through its unique use of language and exploration of themes like morality, free will, and the nature of evil, the book challenges readers to confront the implications of state control and the loss of individual autonomy."
  },
  {
    "title": "The Tale of Genji",
    "author": "Murasaki Shikibu",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Tale of Genji,\" written by Murasaki Shikibu in the early 11th century, is often regarded as the world's first novel. It follows the life and romantic exploits of Hikaru Genji, a nobleman in the Heian court, exploring themes of love, loss, and the complexities of human relationships within a richly detailed historical and cultural backdrop."
  },
  {
    "title": "The Canterbury Tales",
    "author": "Geoffrey Chaucer",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Canterbury Tales\" is a collection of stories written by Geoffrey Chaucer in the late 14th century, featuring a diverse cast of pilgrims journeying to the shrine of Saint Thomas Becket in Canterbury. Each character tells their own tale, offering a vivid exploration of medieval society, morality, and human nature, all infused with humor and social critique."
  },
  {
    "title": "King Lear",
    "author": "William Shakespeare",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"King Lear\" is a tragic play by William Shakespeare that explores themes of power, betrayal, and madness as the aging King Lear divides his kingdom among his daughters based on their flattery, leading to devastating consequences. The narrative unfolds the tragic downfall of Lear as he descends into madness, confronting the harsh realities of loyalty, filial duty, and the human condition."
  },
  {
    "title": "Paradise Lost",
    "author": "John Milton",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Paradise Lost\" is an epic poem by John Milton that explores the biblical story of the Fall of Man, depicting the rebellion of Satan and the temptation of Adam and Eve in the Garden of Eden. Through its intricate verse and profound themes, the poem delves into the nature of free will, the struggle between good and evil, and the consequences of disobedience to God."
  },
  {
    "title": "The Unbearable Lightness of Being",
    "author": "Milan Kundera",
    "category": "100 Philosophy & Psychology",
    "genre": "Existentialist",
    "description": "\"The Unbearable Lightness of Being\" by Milan Kundera explores the complexities of love, philosophy, and existentialism through the intertwined lives of four characters in 1960s Czechoslovakia. The novel delves into themes of identity, freedom, and the burden of choice, ultimately questioning the significance of our actions in a fleeting and transient existence."
  },
  {
    "title": "For Whom the Bell Tolls",
    "author": "Ernest Hemingway",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"For Whom the Bell Tolls\" by Ernest Hemingway follows the story of Robert Jordan, an American dynamiter who fights alongside Spanish guerrillas during the Spanish Civil War. As he grapples with his ideals and the harsh realities of war, Jordan forms deep connections with the people around him, ultimately questioning the significance of individual sacrifice in the face of collective struggle."
  },
  {
    "title": "The Name of the Rose",
    "author": "Umberto Eco",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Name of the Rose\" is a historical murder mystery set in a 14th-century Italian monastery, where a Franciscan friar, William of Baskerville, investigates a series of unexplained deaths. Blending philosophical inquiry, semiotics, and medieval history, Umberto Eco weaves a complex narrative that explores themes of knowledge, faith, and the power of books."
  },
  {
    "title": "First Folio",
    "author": "William Shakespeare",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "The First Folio is a collection of William Shakespeare's plays, published in 1623, seven years after his death. It is the first collected edition of his works and includes 36 plays, preserving many that might have otherwise been lost, and is considered a cornerstone of English literature."
  },
  {
    "title": "Tess of the d'Urbervilles",
    "author": "Thomas Hardy",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Tess of the d'Urbervilles\" by Thomas Hardy tells the tragic story of Tess Durbeyfield, a young woman from a poor family who is drawn into the world of the upper class when she discovers her ancestral ties to the wealthy d'Urberville family. As Tess struggles with societal expectations, personal loss, and the consequences of her choices, the novel explores themes of femininity, fate, and the harsh realities of Victorian society."
  },
  {
    "title": "Memoirs of Hadrian",
    "author": "Marguerite Yourcenar",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Memoirs of Hadrian\" by Marguerite Yourcenar is a historical novel presented as a letter from the Roman Emperor Hadrian to his successor, Marcus Aurelius. Through reflective prose, the book explores themes of love, power, philosophy, and the passage of time, offering profound insights into both Hadrian's life and the complexity of human experience."
  },
  {
    "title": "Doctor Faustus",
    "author": "Thomas Mann",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Doctor Faustus\" by Thomas Mann is a novel that explores the life of composer Adrian Leverkühn, who makes a Faustian bargain in his quest for artistic genius at the cost of his sanity and humanity. The story delves into themes of ambition, creativity, and the moral implications of sacrificing one's soul for greatness, set against the backdrop of a Europe on the brink of chaos."
  },
  {
    "title": "Wide Sargasso Sea",
    "author": "Jean Rhys",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Wide Sargasso Sea\" by Jean Rhys serves as a prequel to Charlotte Brontë's \"Jane Eyre,\" exploring the life of Antoinette Cosway, a Creole woman in Jamaica whose identity is shaped by colonialism, racism, and family trauma. Through her relationships and struggles, the novel examines themes of love, isolation, and the impact of cultural dislocation."
  },
  {
    "title": "If This Is a Man",
    "author": "Primo Levi",
    "category": "300 Social Sciences",
    "genre": "Cultural",
    "description": "\"If This Is a Man\" by Primo Levi is a poignant memoir recounting the author's harrowing experiences as an Italian Jew interned in Auschwitz during World War II. Through his vivid narrative, Levi explores the depths of human suffering, dignity, and the moral complexities of survival in the face of dehumanization."
  },
  {
    "title": "Lady Chatterley's Lover",
    "author": "D. H. Lawrence",
    "category": "800 Literature",
    "genre": "Banned books",
    "description": "\"Lady Chatterley's Lover\" by D. H. Lawrence is a poignant exploration of love and desire, focusing on the passionate affair between Constance Reid, Lady Chatterley, and the gamekeeper, Oliver Mellors, against the backdrop of societal constraints in early 20th-century England. The novel challenges the conventions of class and morality, ultimately advocating for the importance of emotional and physical connection in personal fulfillment."
  },
  {
    "title": "Macbeth",
    "author": "William Shakespeare",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Macbeth\" by William Shakespeare tells the story of a Scottish nobleman who, driven by ambition and prophesies from three witches, murders King Duncan to seize the throne. As Macbeth succumbs to guilt and paranoia, his reign spirals into tyranny and madness, ultimately leading to his downfall."
  },
  {
    "title": "Doctor Zhivago",
    "author": "Boris Pasternak",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Doctor Zhivago\" by Boris Pasternak is a sweeping narrative set against the tumult of the Russian Revolution, following the life of Yuri Zhivago, a physician and poet, as he navigates personal and political upheaval. The novel explores complex themes of love, loss, and the quest for meaning amidst societal chaos, encapsulated in a richly woven tapestry of human experience."
  },
  {
    "title": "The Woman in White",
    "author": "Wilkie Collins",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Woman in White\" by Wilkie Collins is a gripping mystery novel that follows the intertwining fates of several characters, including the enigmatic figure of a woman dressed in white who escapes from a mental institution. As the story unfolds through multiple perspectives, themes of identity, deception, and social inequality come to the fore, creating a tale of suspense and intrigue that keeps readers on the edge of their seats."
  },
  {
    "title": "The Interpretation of Dreams",
    "author": "Sigmund Freud",
    "category": "300 Social Sciences",
    "genre": "Counselling",
    "description": "\"The Interpretation of Dreams\" by Sigmund Freud explores the significance of dreams as a window into the unconscious mind, proposing that they reveal repressed desires and unresolved conflicts. Freud introduces key concepts such as the meaning of symbolism in dreams and the distinction between manifest and latent content, laying the groundwork for modern psychoanalytic thought."
  },
  {
    "title": "One Day in the Life of Ivan Denisovich",
    "author": "Aleksandr Solzhenitsyn",
    "category": "800 Literature",
    "genre": "Dystopian",
    "description": "\"One Day in the Life of Ivan Denisovich\" by Aleksandr Solzhenitsyn tells the harrowing yet resilient story of Ivan Denisovich Shukhov, a prisoner in a Soviet labor camp enduring the brutal realities of life in a Stalinist regime. Through the portrayal of a single day in Shukhov's life, the novel explores themes of survival, dignity, and the human spirit amidst oppression."
  },
  {
    "title": "Poems of Emily Dickinson",
    "author": "Emily Dickinson",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Poems of Emily Dickinson\" showcases the profound and introspective poetry of one of America's most celebrated poets. Through her innovative use of language, form, and rhyme, Dickinson explores themes of nature, love, death, and immortality, inviting readers into the depth of her unique perspective on life."
  },
  {
    "title": "Sons and Lovers",
    "author": "D. H. Lawrence",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Sons and Lovers\" by D. H. Lawrence explores the complex relationships within a working-class family in early 20th-century England, particularly focusing on the intense bond between a young man, Paul Morel, and his mother, Gertrude. As Paul navigates his struggles with love, identity, and societal expectations, the novel delves into themes of family loyalty, desire, and the search for individuality."
  },
  {
    "title": "Tom Jones",
    "author": "Henry Fielding",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Tom Jones\" by Henry Fielding is a comedic novel that tells the life story of an orphaned boy, Tom, as he embarks on a quest for love and identity. Through a series of misadventures and encounters with a colorful cast of characters, the novel satirizes the social norms of 18th-century England while exploring themes of morality, class, and human nature."
  },
  {
    "title": "The Charterhouse of Parma",
    "author": "Stendhal",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Charterhouse of Parma\" by Stendhal is a historical novel that follows the life of Fabrice del Dongo, an idealistic young man navigating the turbulent political landscape of 19th-century Italy. Through his experiences in love, war, and the quest for personal fulfillment, the novel explores themes of romanticism, identity, and the conflict between personal desires and societal expectations."
  },
  {
    "title": "A Sentimental Education",
    "author": "Gustave Flaubert",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"A Sentimental Education\" by Gustave Flaubert follows the life of Frédéric Moreau, a young man in 19th-century France, as he navigates love, ambition, and the complexities of adult life against the backdrop of societal change. The novel explores themes of romantic idealism, disillusionment, and the pursuit of self-identity amid the turbulence of the era."
  },
  {
    "title": "The Hitchhiker's Guide to the Galaxy",
    "author": "Douglas Adams",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"The Hitchhiker's Guide to the Galaxy\" by Douglas Adams follows the misadventures of Arthur Dent, an ordinary human who is plucked from Earth just before it is destroyed to make way for a hyperspace highway. Accompanied by his eccentric alien friend Ford Prefect, Arthur navigates a bizarre universe filled with absurdity, humor, and profound philosophical questions, all encapsulated in the titular guidebook."
  },
  {
    "title": "The Three Musketeers",
    "author": "Alexandre Dumas",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"The Three Musketeers\" by Alexandre Dumas follows the adventurous young d'Artagnan as he joins forces with the charismatic musketeers Athos, Porthos, and Aramis to defend the honor of the queen and confront political intrigue in 17th-century France. Combining action, romance, and camaraderie, the novel explores themes of friendship, loyalty, and the struggle against tyranny."
  },
  {
    "title": "Giovanni's Room",
    "author": "James Baldwin",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Giovanni's Room\" by James Baldwin explores the complexities of identity, love, and sexuality through the story of David, an American man living in Paris who grapples with his attraction to Giovanni, an Italian bartender. Set against the backdrop of post-war Europe, the novel delves into themes of alienation, societal expectations, and the inner conflicts of desire."
  },
  {
    "title": "Howards End",
    "author": "E. M. Forster",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Howards End\" by E.M. Forster explores the interconnected lives of three families in early 20th-century England, highlighting themes of class, social change, and the struggle for personal connection. The novel centers around the inheritance of a country house and serves as a metaphor for the shifting social landscape, ultimately advocating for understanding and empathy between different societal groups."
  },
  {
    "title": "And Then There Were None",
    "author": "Agatha Christie",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"And Then There Were None\" is a classic mystery novel by Agatha Christie that follows ten strangers lured to a remote island under various pretenses. As they are systematically murdered one by one, the characters must uncover the identity of the killer among them, revealing dark secrets and moral dilemmas along the way."
  },
  {
    "title": "A Room of One's Own",
    "author": "Virginia Woolf",
    "category": "800 Literature",
    "genre": "Modernist",
    "description": "\"A Room of One's Own\" by Virginia Woolf is an extended essay exploring the need for female writers to have both literal and figurative space to create. Through a blend of feminist criticism and personal reflection, Woolf argues that financial independence and a private, dedicated space are essential for women to express their creativity and assert their literary voice."
  },
  {
    "title": "Fahrenheit 451",
    "author": "Ray Bradbury",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Fahrenheit 451\" by Ray Bradbury is a dystopian novel set in a future society where books are banned, and \"firemen\" burn any that are found. The story follows Montag, a fireman who begins to question the oppressive regime and seeks knowledge and freedom through literature."
  },
  {
    "title": "One Flew Over the Cuckoo's Nest",
    "author": "Ken Kesey",
    "category": "800 Literature",
    "genre": "Banned books",
    "description": "\"One Flew Over the Cuckoo's Nest\" by Ken Kesey tells the story of Randle McMurphy, a rebellious inmate in a mental institution who challenges the oppressive authority of Nurse Ratched and inspires his fellow patients to reclaim their individuality. Set against the backdrop of 1960s America, the novel explores themes of freedom, conformity, and the struggle between sanity and insanity."
  },
  {
    "title": "Tender Is the Night",
    "author": "F. Scott Fitzgerald",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Tender Is the Night\" by F. Scott Fitzgerald explores the complexities of love and the decline of an American expatriate couple in 1920s Europe. Through the story of Dick Diver, a charismatic psychiatrist, and his deteriorating marriage to the mentally unstable actress Nicole Warren, Fitzgerald poignantly depicts the themes of ambition, mental illness, and the disillusionment of the Jazz Age."
  },
  {
    "title": "The Prince",
    "author": "Niccolo Machiavelli",
    "category": "800 Literature",
    "genre": "Nonfiction",
    "description": "\"The Prince\" by Niccolò Machiavelli is a political treatise that offers pragmatic advice on ruling and maintaining power, emphasizing the use of cunning and realpolitik. Through historical examples and direct observations, Machiavelli advocates for a ruler's ability to adapt to changing circumstances, often prioritizing effectiveness over morality."
  },
  {
    "title": "Love in the Time of Cholera",
    "author": "Gabriel García Márquez",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Love in the Time of Cholera\" by Gabriel García Márquez explores the enduring nature of love through the lives of Florentino Ariza and Fermina Daza, whose passion spans over five decades. Set against the backdrop of 19th-century Caribbean society, the novel delves into themes of romance, aging, and the complexities of human relationships."
  },
  {
    "title": "Harry Potter And The Philosopher's Stone",
    "author": "J. K. Rowling",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"Harry Potter and the Philosopher's Stone\" follows the journey of an orphaned boy, Harry Potter, who discovers he is a wizard on his eleventh birthday. As he begins his education at Hogwarts School of Witchcraft and Wizardry, he uncovers the secrets of his past and faces challenges that test his bravery and friendship."
  },
  {
    "title": "Steppenwolf",
    "author": "Hermann Hesse",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Steppenwolf\" by Hermann Hesse explores the inner conflict of Harry Haller, a man divided between his human and wolf-like instincts, reflecting on the struggle for identity and understanding in a divided society. Through a blend of existential philosophy and surreal experiences, the novel delves into themes of self-discovery, isolation, and the search for meaning in a chaotic world."
  },
  {
    "title": "The Complete Sherlock Holmes",
    "author": "Arthur Conan Doyle",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"The Complete Sherlock Holmes\" compiles all of Sir Arthur Conan Doyle's iconic detective stories featuring the brilliant yet eccentric detective Sherlock Holmes and his steadfast companion, Dr. John Watson. Together, they unravel complex mysteries using keen observation and deductive reasoning, making this collection a cornerstone of classic detective literature."
  },
  {
    "title": "Confessions of Zeno",
    "author": "Italo Svevo",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Confessions of Zeno\" by Italo Svevo is a novel that presents the life and psyche of Zeno Cosini, a businessman undergoing psychoanalysis. Through a series of humorous and introspective confessions, Zeno explores his relationship with addiction, his family, and the complexity of human behavior, ultimately reflecting on the themes of self-deception and the pursuit of meaning in life."
  },
  {
    "title": "Light in August",
    "author": "William Faulkner",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Light in August\" by William Faulkner explores themes of race, identity, and the search for belonging in the American South. The novel intertwines the lives of its characters, particularly focusing on the pregnant Lena Grove and the enigmatic Joe Christmas, as they navigate a society marked by deep-rooted prejudices and personal struggles."
  },
  {
    "title": "Decameron",
    "author": "Giovanni Boccaccio",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Decameron\" by Giovanni Boccaccio is a collection of 100 storytelling tales framed within the setting of ten young people fleeing the Black Death in 14th-century Florence. Through their narratives, the work explores themes of love, wit, and human folly, showcasing a vivid tapestry of medieval life and social commentary."
  },
  {
    "title": "Lord Jim",
    "author": "Joseph Conrad",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"Lord Jim\" by Joseph Conrad tells the story of Jim, a young seaman who seeks redemption after a moment of cowardice leads to his abandonment of a sinking ship and its passengers. Struggling with guilt and the quest for honor, Jim's journey explores themes of bravery, betrayal, and the complexities of human nature."
  },
  {
    "title": "The Hobbit",
    "author": "J. R. R. Tolkien",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"The Hobbit\" by J.R.R. Tolkien follows the adventurous journey of Bilbo Baggins, a reluctant hobbit who is thrust into a quest to help a group of dwarves reclaim their homeland from the dragon Smaug. Along the way, Bilbo encounters various creatures, faces numerous challenges, and discovers his own courage and resourcefulness."
  },
  {
    "title": "Rabbit, Run",
    "author": "John Updike",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Rabbit, Run\" by John Updike follows the life of Harry \"Rabbit\" Angstrom, a disillusioned former high school basketball star who struggles with the constraints of marriage and suburban life. As Rabbit attempts to escape his responsibilities and seek personal freedom, the novel explores themes of existential longing, societal expectations, and the complexities of human relationships."
  },
  {
    "title": "Man's Fate",
    "author": "Andre Malraux",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Man's Fate\" by André Malraux explores the complexities of human existence and the struggle for meaning against the backdrop of the Chinese Revolution. Through the intertwining lives of its characters, the novel delves into themes of fate, freedom, and the pursuit of ideals in a turbulent world."
  },
  {
    "title": "The Prime of Miss Jean Brodie",
    "author": "Muriel Spark",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Prime of Miss Jean Brodie\" by Muriel Spark follows an eccentric and charismatic teacher, Miss Jean Brodie, who influences a group of girls in 1930s Edinburgh with her unconventional views on art, politics, and life. As she seeks to mold them into a unique cadre of future leaders, her manipulative nature and the consequences of her choices ultimately lead to unforeseen betrayal and tragedy."
  },
  {
    "title": "Confessions",
    "author": "Augustine",
    "category": "800 Literature",
    "genre": "Autobiography",
    "description": "\"Confessions\" by Augustine of Hippo is a philosophical and theological work that combines autobiography with reflections on sin, grace, and the nature of God. Through personal anecdotes, Augustine explores his journey from a life of indulgence to a deep spiritual awakening, ultimately embracing Christianity and the transformative power of divine love."
  },
  {
    "title": "White Teeth",
    "author": "Zadie Smith",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"White Teeth\" by Zadie Smith explores the lives of two families—one immigrant and one British—intertwined over several decades in London. Through themes of identity, multiculturalism, and the complexities of modern life, the novel examines the challenges and connections that shape their experiences across generations."
  },
  {
    "title": "The Spy Who Came in From the Cold",
    "author": "John le Carré",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Spy Who Came in From the Cold\" by John le Carré is a gripping Cold War espionage novel that follows British spy Alec Leamas as he embarks on a perilous mission to bring down a high-ranking East German intelligence officer. As Leamas navigates a world of betrayal and moral ambiguity, he confronts the harsh realities of loyalty and sacrifice in the covert world of espionage."
  },
  {
    "title": "Metamorphoses",
    "author": "Ovid",
    "category": "900 History & Geography",
    "genre": "Ancient",
    "description": "\"Metamorphoses\" by Ovid is a narrative poem that weaves together a series of mythological stories, exploring the theme of transformation in both gods and mortals. Through vivid tales of love, loss, and change, Ovid captures the fluidity of identity and the interplay between the human and divine."
  },
  {
    "title": "A Good Man Is Hard to Find",
    "author": "Flannery O'Connor",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"A Good Man Is Hard to Find\" is a short story by Flannery O'Connor that explores themes of morality, family, and the often-complex nature of goodness. Through a family's ill-fated road trip that leads them to a confrontation with an escaped convict known as The Misfit, O'Connor delves into the darkness of human nature and the possibility of redemption."
  },
  {
    "title": "Winnie the Pooh",
    "author": "A. A. Milne",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"Winnie the Pooh,\" by A. A. Milne, is a charming collection of stories that follows the adventures of a lovable bear named Pooh and his friends in the Hundred Acre Wood. Through their whimsical escapades, the book explores themes of friendship, loyalty, and the simple joys of childhood."
  },
  {
    "title": "The Flowers of Evil",
    "author": "Charles Baudelaire",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Flowers of Evil,\" published in 1857, is a seminal poetry collection by Charles Baudelaire that explores the themes of beauty, morality, and the complexities of human experience. Through vivid imagery and poignant verse, Baudelaire delves into the darker aspects of life, addressing the dualities of love and despair, sin and redemption."
  },
  {
    "title": "Brighton Rock",
    "author": "Graham Greene",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"Brighton Rock\" by Graham Greene follows the complex journey of Pinkie Brown, a young gangster in 1930s Brighton, as he navigates a world of crime, moral ambiguity, and existential dread. Through his relentless pursuit of power and survival, Greene explores themes of fate, guilt, and the struggle between good and evil."
  },
  {
    "title": "The Corrections",
    "author": "Jonathan Franzen",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"The Corrections\" by Jonathan Franzen follows the dysfunction of the Lambert family as they navigate personal crises and the complexities of modern life. Through dark humor and incisive social commentary, the novel explores themes of familial obligation, individual aspirations, and the quest for redemption in contemporary America."
  },
  {
    "title": "Of Mice and Men",
    "author": "John Steinbeck",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Of Mice and Men\" by John Steinbeck tells the poignant story of two displaced ranch workers, George and Lennie, who dream of owning their own land during the Great Depression. Their friendship is tested by societal challenges and Lennie's mental disability, ultimately leading to a tragic confrontation with their harsh reality."
  },
  {
    "title": "On the Origin of Species",
    "author": "Charles Darwin",
    "category": "000 Generalities",
    "genre": "Encyclopedic",
    "description": "\"On the Origin of Species,\" published in 1859, presents Charles Darwin's groundbreaking theory of evolution through natural selection, arguing that species evolve over time due to environmental pressures and genetic variation. The work fundamentally transformed the scientific understanding of biology by providing a framework for the diversity of life on Earth."
  },
  {
    "title": "Fairy Tales and Stories",
    "author": "Hans Christian Andersen",
    "category": "800 Literature",
    "genre": "Children's books",
    "description": "\"Fairy Tales and Stories\" by Hans Christian Andersen is a cherished collection of whimsical and enchanting tales that explore themes of love, courage, and the human experience. With memorable characters and imaginative narratives, Andersen's stories, such as \"The Little Mermaid\" and \"The Ugly Duckling,\" continue to captivate readers of all ages with their timeless morals and imaginative storytelling."
  },
  {
    "title": "A Wrinkle In Time",
    "author": "Madeleine L'Engle",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"A Wrinkle in Time\" by Madeleine L'Engle follows the adventures of Meg Murry, her brother Charles Wallace, and their friend Calvin O'Keefe as they journey through space and time to rescue Meg's father from an evil force. Blending elements of science fiction and fantasy, the story explores themes of love, courage, and the battle between good and evil."
  },
  {
    "title": "The End of the Affair",
    "author": "Graham Greene",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"The End of the Affair\" by Graham Greene explores the complexities of love, faith, and jealousy through the affair between writer Maurice Bendrix and Sarah Miles, the wife of a civil servant, in war-torn London. The story delves into themes of obsession and the search for meaning in a world rife with uncertainty and moral ambiguity."
  },
  {
    "title": "Molloy",
    "author": "Samuel Beckett",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Molloy\" by Samuel Beckett is a novel that intertwines the fragmented narratives of two characters, Molloy and Jacques, exploring themes of identity, existence, and the nature of reality. Through a unique blend of dark humor and existential philosophy, the book delves into the complexities of human experience and the search for meaning in a chaotic world."
  },
  {
    "title": "The Remains of the Day",
    "author": "Kazuo Ishiguro",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Remains of the Day\" by Kazuo Ishiguro follows Stevens, an English butler who reflects on his life and career while taking a road trip across the English countryside. Through his introspective journey, he grapples with themes of duty, regret, and the passage of time, ultimately contemplating the personal sacrifices he made in service of loyalty and professionalism."
  },
  {
    "title": "An American Tragedy",
    "author": "Theodore Dreiser",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"An American Tragedy\" by Theodore Dreiser explores the life of Clyde Griffiths, a young man torn between his ambitions and the moral dilemmas he faces. Set against the backdrop of early 20th-century America, the novel delves into themes of class, ambition, and the consequences of personal choices, ultimately revealing the dark side of the American Dream."
  },
  {
    "title": "The Good Soldier Svejk",
    "author": "Jaroslav Hašek",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"The Good Soldier Švejk\" by Jaroslav Hašek is a satirical novel that follows the misadventures of Josef Švejk, an apparently bumbling soldier in World War I Austria-Hungary who uses wit and humor to navigate the absurdities of war and bureaucracy. Through Švejk's outrageous antics and candid observations, the novel critiques the incompetence of military and political systems, blending dark comedy with profound social commentary."
  },
  {
    "title": "Watership Down",
    "author": "Richard Adams",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"Watership Down\" by Richard Adams is an epic tale that follows a group of rabbits as they escape their warren in search of a new home, facing various challenges and threats along the way. The story explores themes of survival, leadership, and the struggle for freedom, enriched by detailed world-building and anthropomorphic characters."
  },
  {
    "title": "The Counterfeiters",
    "author": "André Gide",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "In \"The Counterfeiters,\" André Gide explores the themes of identity, authenticity, and moral ambiguity through the interconnected lives of a group of characters in early 20th-century Paris. The novel delves into the complexities of human relationships and the nature of creativity, ultimately questioning what it means to be true to oneself."
  },
  {
    "title": "The Autobiography of Malcolm X",
    "author": "Alex Haley",
    "category": "800 Literature",
    "genre": "Autobiography",
    "description": "\"The Autobiography of Malcolm X,\" as told to Alex Haley, chronicles the life and evolution of Malcolm X, detailing his transformation from a troubled youth to a prominent civil rights activist. Through vivid storytelling, the book explores themes of identity, race, and justice, offering profound insights into the struggles and triumphs of the African American experience in the mid-20th century."
  },
  {
    "title": "Fathers and Sons",
    "author": "Ivan Turgenev",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Fathers and Sons\" by Ivan Turgenev explores the generational conflict between traditional values and the emerging nihilistic philosophy of the younger generation in 19th-century Russia. The novel follows the relationship between the disillusioned student Bazarov and his father, highlighting the tensions and misunderstandings that arise from their differing worldviews."
  },
  {
    "title": "Atonement",
    "author": "Ian McEwan",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Atonement\" by Ian McEwan explores the complexities of love, guilt, and the impact of a single moment on the lives of three characters over several decades. The narrative unfolds through the eyes of Briony Tallis, whose false accusation as a child sets off a chain of events that irrevocably alters the destinies of her sister Cecilia and Robbie Turner, the man she loves."
  },
  {
    "title": "Berlin Alexanderplatz",
    "author": "Alfred Döblin",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Berlin Alexanderplatz\" by Alfred Döblin is a modernist novel that follows the life of Franz Biberkopf, a former convict trying to reintegrate into society in 1920s Berlin. The book captures the chaotic atmosphere of the city through innovative narrative techniques, exploring themes of alienation, identity, and the struggle for meaning in an urban landscape."
  },
  {
    "title": "My Antonia",
    "author": "Willa Cather",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"My Ántonia\" by Willa Cather is a coming-of-age novel that tells the story of Jim Burden, who reflects on his childhood in Nebraska and his deep connection with Ántonia Shimerda, a resilient immigrant girl. Through their bond and experiences, Cather explores themes of pioneer life, the immigrant experience, and the enduring impact of the past."
  },
  {
    "title": "Gargantua and Pantagruel",
    "author": "Francois Rabelais",
    "category": "800 Literature",
    "genre": "Dark",
    "description": "\"Gargantua and Pantagruel\" by François Rabelais is a satirical novel that chronicles the adventures of two giants, the father Gargantua and his son Pantagruel, exploring themes of humanism, education, and the folly of society. Through a blend of humor, linguistic play, and social commentary, Rabelais critiques the politics, religion, and culture of his time, inviting readers to question conventional wisdom and embrace a more liberated perspective on life."
  },
  {
    "title": "A Tale of Two Cities",
    "author": "Charles Dickens",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"A Tale of Two Cities\" by Charles Dickens is a historical novel set during the tumultuous times of the French Revolution, exploring themes of resurrection, sacrifice, and the struggle between tyranny and freedom. The story follows the intertwined lives of characters like Charles Darnay and Sydney Carton, highlighting the stark contrasts between Paris and London while emphasizing the power of love and redemption."
  },
  {
    "title": "A House for Mr. Biswas",
    "author": "V. S. Naipaul",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"A House for Mr. Biswas\" by V. S. Naipaul follows the life of Mohun Biswas, a Trinidadian of Indian descent, as he struggles against familial obligations and societal expectations in his quest for independence and stability. The novel intricately explores themes of identity, belonging, and the pursuit of personal dignity through Biswas's tumultuous journey toward owning his own home."
  },
  {
    "title": "The Once and Future King",
    "author": "T. H. White",
    "category": "800 Literature",
    "genre": "Arthurian",
    "description": "\"The Once and Future King\" by T.H. White is a retelling of the Arthurian legends that chronicles the life of King Arthur from his childhood through his reign and eventual downfall. Blending humor, philosophy, and tragedy, the novel explores themes of power, justice, and the quest for identity through Arthur's relationships with key figures like Merlin, Guinevere, and Lancelot."
  },
  {
    "title": "U.S.A. Trilogy",
    "author": "John Dos Passos",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "The U.S.A. Trilogy by John Dos Passos is a groundbreaking modernist work that intricately weaves together the lives of various characters against the backdrop of early 20th-century America. Employing innovative narrative techniques, such as stream-of-consciousness and a blend of fictional and non-fictional elements, the trilogy explores the complexities of American society, capitalism, and the individual's place within it."
  },
  {
    "title": "Communist Manifesto",
    "author": "Karl Marx, Friedrich Engels",
    "category": "800 Literature",
    "genre": "Nonfiction",
    "description": "\"The Communist Manifesto,\" written by Karl Marx and Friedrich Engels in 1848, outlines the principles of communism and critiques capitalism, advocating for the working class to rise against the bourgeoisie. The manifesto emphasizes class struggle, the need for revolutionary change, and the vision of a classless society where the means of production are collectively owned."
  },
  {
    "title": "Bonjour Tristesse",
    "author": "Francoise Sagan",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Bonjour Tristesse,\" a novel by Françoise Sagan, explores the life of a young woman named Cécile who spends a summer on the French Riviera with her father. As she grapples with her carefree lifestyle and the complexities of love and loss, Cécile's manipulative actions lead to unexpected consequences and a poignant reflection on the nature of happiness and sorrow."
  },
  {
    "title": "Never Let Me Go",
    "author": "Kazuo Ishiguro",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Never Let Me Go\" by Kazuo Ishiguro is a poignant dystopian novel that follows the lives of students at Hailsham, a seemingly idyllic English boarding school, as they grapple with the haunting truth of their existence. Through their relationships and memories, the story explores themes of love, identity, and the ethical implications of cloning and humanity."
  },
  {
    "title": "All the King's Men",
    "author": "Robert Penn Warren",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "*All the King's Men* by Robert Penn Warren is a Pulitzer Prize-winning novel that follows the rise and fall of Willie Stark, a charismatic and ruthless politician in the American South. Through the eyes of Jack Burden, a journalist and former ally, the story explores themes of power, corruption, and the moral complexities of political ambition."
  },
  {
    "title": "A Confederacy of Dunces",
    "author": "John Kennedy Toole",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"A Confederacy of Dunces\" follows the eccentric Ignatius J. Reilly, a self-proclaimed intellectual living in New Orleans who struggles to find his place in a world he deems absurd. Through a colorful cast of characters and humorous situations, the novel explores themes of social outcasts, absurdity, and the clash between individuality and societal norms."
  },
  {
    "title": "Blood Meridian",
    "author": "Cormac McCarthy",
    "category": "800 Literature",
    "genre": "Dark",
    "description": "\"Blood Meridian\" by Cormac McCarthy is a stark and violent novel set in the mid-19th century American West, following the journey of a teenage protagonist known as \"the Kid\" as he becomes embroiled with a brutal group of Indian-hunters led by the enigmatic and sadistic Judge Holden. The book explores themes of violence, morality, and the dark undercurrents of human nature, ultimately painting a bleak portrait of civilization's frontier."
  },
  {
    "title": "A Christmas Carol",
    "author": "Charles Dickens",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"A Christmas Carol\" by Charles Dickens tells the transformative story of Ebenezer Scrooge, a miserly old man who, through supernatural encounters with three spirits on Christmas Eve, learns the importance of compassion, generosity, and the holiday spirit. As he reflects on his past, present, and future, Scrooge ultimately embraces the joy of giving and the value of human connection."
  },
  {
    "title": "Anne of Green Gables",
    "author": "L. M. Montgomery",
    "category": "800 Literature",
    "genre": "Children's books",
    "description": "\"Anne of Green Gables\" follows the adventures of Anne Shirley, an imaginative and spirited orphan who is mistakenly sent to live with siblings Marilla and Matthew Cuthbert in rural Prince Edward Island. As Anne navigates her new life, she brings both chaos and joy to the Cuthberts, forging lasting friendships and discovering her own identity along the way."
  },
  {
    "title": "Disgrace",
    "author": "J. M. Coetzee",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Disgrace\" by J.M. Coetzee tells the story of David Lurie, a disgraced university professor in post-apartheid South Africa, who faces societal and personal upheaval following an affair with a student. As he grapples with guilt, redemption, and the complexities of power dynamics, the novel explores themes of colonialism, race, and the human condition."
  },
  {
    "title": "The Murder of Roger Ackroyd",
    "author": "Agatha Christie",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"The Murder of Roger Ackroyd\" is a classic detective novel by Agatha Christie, featuring the famous Belgian detective Hercule Poirot. Set in a quaint English village, the story unfolds as Poirot investigates the mysterious murder of Roger Ackroyd, revealing unexpected twists and a groundbreaking narrative style that redefines the genre."
  },
  {
    "title": "The Road",
    "author": "Cormac McCarthy",
    "category": "800 Literature",
    "genre": "Apocalyptic",
    "description": "\"The Road\" by Cormac McCarthy is a haunting post-apocalyptic novel that follows a father and his young son as they navigate a desolate landscape filled with danger and despair. Their journey, marked by themes of love, survival, and hope, explores the bond between parent and child in a world stripped of civilization and humanity."
  },
  {
    "title": "East of Eden",
    "author": "John Steinbeck",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"East of Eden\" by John Steinbeck is a sprawling family saga set in California's Salinas Valley, exploring themes of good versus evil, free will, and the complexity of human nature. The novel interweaves the lives of two families, the Trasks and the Hamiltons, drawing parallels to the biblical story of Cain and Abel, as characters grapple with their personal struggles and the legacy of their choices."
  },
  {
    "title": "A Wizard of Earthsea",
    "author": "Ursula K. Le Guin",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"A Wizard of Earthsea\" by Ursula K. Le Guin follows the journey of Ged, a young boy with a natural talent for magic, as he discovers his own power and the responsibilities that come with it. Set in the archipelago of Earthsea, the story explores themes of identity, balance, and the struggle between light and darkness."
  },
  {
    "title": "The Haunting of Hill House",
    "author": "Shirley Jackson",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Haunting of Hill House\" by Shirley Jackson follows a group of people invited to a mysterious mansion to investigate paranormal occurrences. As they delve deeper into the eerie environment, their psychological fears and tensions rise, revealing the power of the haunting both within the house and themselves."
  },
  {
    "title": "Women in Love",
    "author": "D. H. Lawrence",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Woman in Love\" by D. H. Lawrence explores the complex relationships and emotional struggles between two sisters, Ursula and Gudrun Brangwen, and their lovers in early 20th-century England. The novel delves into themes of love, sexuality, individuality, and the search for genuine connection amidst societal constraints."
  },
  {
    "title": "The Life of Samuel Johnson",
    "author": "James Boswell",
    "category": "800 Literature",
    "genre": "Biography",
    "description": "\"The Life of Samuel Johnson,\" written by James Boswell, is a detailed biography that offers an intimate portrait of the renowned 18th-century writer and lexicographer Samuel Johnson. Through a combination of personal anecdotes, conversations, and reflections, Boswell captures Johnson's complex personality, intellectual rigor, and profound insights into human nature."
  },
  {
    "title": "The Lion, The Witch and the Wardrobe",
    "author": "C. S. Lewis",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"The Lion, the Witch and the Wardrobe\" by C.S. Lewis follows the adventures of four siblings—Peter, Susan, Edmund, and Lucy—who discover a magical land called Narnia through a wardrobe. In Narnia, they encounter the benevolent lion Aslan and join the fight against the evil White Witch, who has plunged the land into eternal winter."
  },
  {
    "title": "Of Human Bondage",
    "author": "W. Somerset Maugham",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Of Human Bondage\" by W. Somerset Maugham follows the life of Philip Carey, an orphaned boy with a club foot, as he navigates the complexities of love, ambition, and self-discovery. Set against the backdrop of early 20th-century England, the novel explores the struggles of longing for freedom and individuality amid the constraints of societal expectations and personal relationships."
  },
  {
    "title": "The House of Mirth",
    "author": "Edith Wharton",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"The House of Mirth\" by Edith Wharton follows the life of Lily Bart, a beautiful but impoverished woman navigating the competitive social landscape of New York City's elite society in the early 20th century. As she struggles to secure her place and a suitable marriage, Lily confronts the harsh realities of wealth, morality, and her own aspirations, leading to tragic consequences."
  },
  {
    "title": "Hunger",
    "author": "Knut Hamsun",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Hunger\" by Knut Hamsun follows the struggles of an impoverished writer in early 20th-century Oslo, grappling with acute hunger and existential despair. The narrative delves into his psychological turmoil as he navigates the harsh realities of poverty, ambition, and isolation."
  },
  {
    "title": "Persuasion",
    "author": "Jane Austen",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Persuasion\" by Jane Austen follows the story of Anne Elliot, a young woman who is persuaded to break off her engagement with the love of her life, Frederick Wentworth, due to his lack of fortune. Years later, their paths cross again, prompting Anne to reflect on the choices she made and the enduring nature of love."
  },
  {
    "title": "Democracy in America",
    "author": "Alexis de Tocqueville",
    "category": "300 Social Sciences",
    "genre": "Cultural",
    "description": "\"Democracy in America\" by Alexis de Tocqueville is a seminal work that analyzes the political and social aspects of American society in the early 19th century. Through his observations, Tocqueville explores the strengths and weaknesses of democracy, emphasizing the importance of civic engagement and the role of individualism in shaping the American character."
  },
  {
    "title": "Zorba the Greek",
    "author": "Nikos Kazantzakis",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Zorba the Greek\" by Nikos Kazantzakis tells the story of a young Greek intellectual who embarks on a journey to a remote island, where he meets the exuberant and free-spirited Zorba. Through their friendship, the novel explores themes of passion, the meaning of life, and the contrast between intellectual aspiration and the joy of living fully in the moment."
  },
  {
    "title": "The Republic",
    "author": "Plato",
    "category": "900 History & Geography",
    "genre": "Ancient",
    "description": "In \"The Republic,\" Plato explores the concept of justice and the ideal state through a dialogue led by Socrates, examining the nature of justice, the role of the philosopher-king, and the structure of an ideal society. The work articulates Plato’s vision of a society governed by reason and virtue, ultimately asserting that true happiness arises from living a just life."
  },
  {
    "title": "The Tempest",
    "author": "William Shakespeare",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"The Tempest\" is a play by William Shakespeare that explores themes of magic, betrayal, and redemption on a mysterious island inhabited by the sorcerer Prospero. Through a narrative of reconciliation and forgiveness, the story unfolds as Prospero orchestrates a shipwreck to confront those who wronged him, ultimately leading to the transformation of both himself and his usurpers."
  },
  {
    "title": "Nausea",
    "author": "Jean Paul Sartre",
    "category": "800 Literature",
    "genre": "Dark",
    "description": "\"Nausea\" by Jean-Paul Sartre follows the existential crisis of Antoine Roquentin, a solitary writer who confronts the absurdity of existence and the unsettling nature of reality. As he grapples with feelings of alienation and nausea, the novel explores themes of freedom, choice, and the search for meaning in a seemingly indifferent world."
  },
  {
    "title": "The Turn of the Screw",
    "author": "Henry James",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Turn of the Screw\" by Henry James is a gothic novella that explores the unsettling experiences of a governess tasked with caring for two children at a remote estate. As she uncovers dark secrets and encounters mysterious apparitions, the line between reality and madness blurs, leading to a chilling climax that challenges the nature of perception and morality."
  },
  {
    "title": "A Season in Hell",
    "author": "Arthur Rimbaud",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"A Season in Hell\" is a vivid and intense collection of prose poetry by French symbolist poet Arthur Rimbaud, exploring themes of personal despair, existential crisis, and a longing for liberation. Written during a tumultuous period in Rimbaud's life, the work delves into his struggles with identity, society, and the quest for transcendence, showcasing his revolutionary use of language and imagery."
  },
  {
    "title": "2666",
    "author": "Roberto Bolaño",
    "category": "000 Generalities",
    "genre": "Encyclopedic",
    "description": "\"2666\" by Roberto Bolaño is an intricate and sprawling novel that weaves together five interconnected narratives, each exploring themes of violence, beauty, and the search for meaning in a chaotic world. Set against the backdrop of a fictional Mexican border town plagued by unsolved murders, the book delves into the lives of various characters, including a journalist, an academic, and a reclusive author, ultimately reflecting on the darkness of human existence."
  },
  {
    "title": "Finnegans Wake",
    "author": "James Joyce",
    "category": "000 Generalities",
    "genre": "Encyclopedic",
    "description": "\"Finnegans Wake\" by James Joyce is a groundbreaking and complex novel that explores the cyclical nature of history and time through a dreamlike narrative. Written in an inventive and dense style, it weaves together multiple languages, linguistic puns, and rich symbolism, making it both a challenging and rewarding read."
  },
  {
    "title": "The Secret History",
    "author": "Donna Tartt",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"The Secret History\" by Donna Tartt follows a group of elite college students studying ancient Greek who become entangled in a world of obsession, morality, and murder. As their intellectual pursuits spiral into dark secrets and tragic consequences, the novel explores themes of ambition, privilege, and the boundaries of friendship."
  },
  {
    "title": "Collected Poems of W. B. Yeats",
    "author": "William Butler Yeats",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Collected Poems of W. B. Yeats\" showcases the profound and lyrical works of the Irish poet, capturing themes of love, nature, mythology, and the passage of time. This anthology reflects Yeats's evolution as a poet, weaving together his early romantic verses and later, more complex explorations of identity and spirituality."
  },
  {
    "title": "Invisible Cities",
    "author": "Italo Calvino",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Invisible Cities\" by Italo Calvino is a lyrical exploration of the imagination and the nature of human experience, presented as a series of poetic conversations between the Venetian explorer Marco Polo and Kublai Khan. Through vivid and fantastical descriptions of imaginary cities, the book delves into themes of memory, desire, and the complexities of urban life, blurring the lines between reality and fiction."
  },
  {
    "title": "Tropic of Cancer",
    "author": "Henry Miller",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Tropic of Cancer,\" written by Henry Miller, is a semi-autobiographical novel set in 1930s Paris that chronicles the life of an expatriate writer grappling with poverty, sexuality, and artistic ambition. Through frank and often controversial prose, Miller explores themes of freedom, existentialism, and the search for identity against the backdrop of vibrant, bohemian life."
  },
  {
    "title": "The Amazing Adventures of Kavalier and Clay",
    "author": "Michael Chabon",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"The Amazing Adventures of Kavalier and Clay\" by Michael Chabon follows the lives of two Jewish cousins, Joe Kavalier and Sam Clay, during the Golden Age of comic books in America. As they create a popular superhero named The Escapist, the novel explores themes of escape, identity, and the impact of World War II on their lives and creativity."
  },
  {
    "title": "Death of Virgil",
    "author": "Hermann Broch",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Death of Virgil\" by Hermann Broch is a lyrical exploration of the final moments of the Roman poet Virgil as he grapples with his life's work and imminent death. The novel delves into themes of artistic creation, the nature of existence, and the struggle between the ideal and the real, offering a profound meditation on art and mortality."
  },
  {
    "title": "Out of Africa",
    "author": "Isak Dinesen",
    "category": "300 Social Sciences",
    "genre": "Cultural",
    "description": "\"Out of Africa\" by Isak Dinesen is a lyrical memoir recounting the author's experiences running a coffee plantation in Kenya during the early 20th century. Through vivid storytelling, Dinesen reflects on her deep connection to the African landscape and her relationships with its people, exploring themes of love, loss, and the clash of cultures."
  },
  {
    "title": "The Jungle",
    "author": "Upton Sinclair",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"The Jungle\" by Upton Sinclair is a groundbreaking novel that reveals the harsh realities of immigrant life and the brutal working conditions in the meatpacking industry in early 20th-century America. Through the story of Jurgis Rudkus and his family, Sinclair exposes the exploitation and corruption within the industry, ultimately advocating for social reform and workers' rights."
  },
  {
    "title": "The Stand",
    "author": "Stephen King",
    "category": "800 Literature",
    "genre": "Apocalyptic",
    "description": "\"The Stand\" is an epic post-apocalyptic novel by Stephen King that explores the battle between good and evil following a devastating pandemic that wipes out much of the world's population. As the survivors are drawn to two opposing leaders, they must confront their fears, desires, and the moral complexities of rebuilding society in a world stripped of its former order."
  },
  {
    "title": "Malone Dies",
    "author": "Samuel Beckett",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Malone Dies\" is a novel by Samuel Beckett that explores themes of existence, identity, and the nature of storytelling through the fragmented thoughts of its protagonist, Malone, who is confined to a room and reflects on his life and impending death. As he narrates his experiences and the lives of characters he creates, the work delves into the absurdity of human experience and the struggle to find meaning in a seemingly indifferent universe."
  },
  {
    "title": "The World According to Garp",
    "author": "John Irving",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The World According to Garp\" by John Irving is a poignant and often humorous novel that follows the life of T.S. Garp, the illegitimate son of a feminist icon, as he navigates the complexities of love, family, and identity. Set against a backdrop of personal and societal challenges, the story explores themes of gender, sexuality, and the unpredictability of life through Garp's unique perspective and experiences."
  },
  {
    "title": "The Moviegoer",
    "author": "Walker Percy",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Moviegoer\" by Walker Percy follows Binx Bolling, a disenchanted young man in New Orleans who embarks on a quest for meaning amidst the banality of modern life. Through his obsession with movies and existential introspection, Binx grapples with themes of identity, connection, and the search for authenticity in a world steeped in superficiality."
  },
  {
    "title": "The Forsyte Saga",
    "author": "John Galsworthy",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Forsyte Saga\" by John Galsworthy chronicles the lives and struggles of the affluent Forsyte family in England during the late 19th and early 20th centuries, exploring themes of wealth, class, and the tension between tradition and modernity. Through a multi-generational narrative, it delves into the complexities of love, ambition, and societal expectations, ultimately reflecting on the changing nature of family and society."
  },
  {
    "title": "Austerlitz",
    "author": "W. G. Sebald",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "\"Austerlitz\" by W. G. Sebald follows the life of Jacques Austerlitz, a man who embarks on a quest to discover his past after uncovering his Jewish heritage. Through a blend of memory, history, and reflective narrative, the novel examines themes of trauma, loss, and the impact of war, evoking a profound sense of melancholy and the search for identity in a fragmented world."
  },
  {
    "title": "The Book of Disquiet",
    "author": "Fernando Pessoa",
    "category": "800 Literature",
    "genre": "Diaries & Journals",
    "description": "\"The Book of Disquiet\" by Fernando Pessoa is a fragmented, introspective exploration of the inner life and existential musings of its semi-autobiographical narrator, Bernardo Soares. Through a series of poetic reflections and philosophical insights, the book delves into themes of solitude, identity, and the search for meaning in a disquieting world."
  },
  {
    "title": "Franz Kafka",
    "author": "Franz Kafka",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"Franz Kafka\" is a collection of the author's writings, showcasing his unique blend of surrealism and existential themes. Through his short stories and parables, Kafka explores the complexities of human existence, isolation, and the absurdities of modern life."
  },
  {
    "title": "The Tartar Steppe",
    "author": "Dino Buzzati",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Tartar Steppe\" by Dino Buzzati follows the story of Giovanni Drogo, a young officer who arrives at a remote fortress to await a war against an elusive enemy. As time passes, he becomes increasingly consumed by the monotony of garrison life, reflecting on themes of waiting, existentialism, and the passage of time."
  },
  {
    "title": "Uncle Tom's Cabin",
    "author": "Harriet Beecher Stowe",
    "category": "800 Literature",
    "genre": "Banned books",
    "description": "\"Uncle Tom's Cabin,\" written by Harriet Beecher Stowe, is a seminal novel published in 1852 that exposes the harsh realities of slavery in America through the experiences of its title character, Uncle Tom, a dignified enslaved man. The book played a significant role in shaping public opinion against slavery and is credited with fueling the abolitionist movement."
  },
  {
    "title": "The Gulag Archipelago",
    "author": "Aleksandr Solzhenitsyn",
    "category": "800 Literature",
    "genre": "Memoir",
    "description": "\"The Gulag Archipelago\" by Aleksandr Solzhenitsyn is a poignant and harrowing account of the Soviet Union's forced labor camp system, detailing the experiences of political prisoners and the brutal conditions they endured. Through firsthand testimonies and extensive research, Solzhenitsyn exposes the pervasive oppression and moral consequences of totalitarianism, illuminating the depths of human suffering and resilience."
  },
  {
    "title": "The Godfather",
    "author": "Mario Puzo",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"The Godfather\" by Mario Puzo explores the intricate and often brutal world of the Italian-American Mafia through the lens of the powerful Corleone family. Central to the story is Don Vito Corleone, a charismatic patriarch who navigates crime, loyalty, and family ties while maintaining his code of honor in a dangerous underworld."
  },
  {
    "title": "Dangerous Liaison",
    "author": "Pierre Choderlos de Laclos",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Dangerous Liaisons,\" written by Pierre Choderlos de Laclos, is an epistolary novel set in 18th-century France that explores themes of manipulation, seduction, and the complexities of love. Through the intricate correspondence between a scheming Marquise and her former lover, the story unveils the destructive power of deceit and the moral ambiguity of its characters."
  },
  {
    "title": "Siddhartha",
    "author": "Hermann Hesse",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Siddhartha,\" a novel by Hermann Hesse, follows the spiritual journey of a young man named Siddhartha as he seeks enlightenment and self-discovery during the time of the Buddha. Through a series of experiences, including material success, personal loss, and encounters with various philosophies, Siddhartha ultimately learns that true understanding comes from within."
  },
  {
    "title": "Medea",
    "author": "Euripides",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Medea\" by Euripides tells the story of a betrayed woman who seeks revenge against her unfaithful husband, Jason, after he leaves her for another. Fueled by a burning desire for justice, Medea's actions lead to a tragic climax, showcasing themes of passion, betrayal, and the consequences of vengeance."
  },
  {
    "title": "Oblomov",
    "author": "Ivan Goncharov",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Oblomov\" by Ivan Goncharov tells the story of Ilya Ilyich Oblomov, an idle and lethargic nobleman who struggles with the demands of life and society. The novel explores themes of inertia, the conflict between dreams and reality, and the stifling nature of the Russian aristocracy in the 19th century."
  },
  {
    "title": "The Double Helix",
    "author": "James D. Watson",
    "category": "800 Literature",
    "genre": "Biography",
    "description": "\"The Double Helix\" by James D. Watson is a personal account of the discovery of the structure of DNA, capturing the intense competition and collaboration among scientists in the 1950s. Through Watson's perspective, the book provides insights into the creative process of scientific research and the personalities involved, highlighting both the excitement and challenges faced in unraveling one of biology's greatest mysteries."
  },
  {
    "title": "The Adventures of Augie March",
    "author": "Saul Bellow",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Adventures of Augie March\" by Saul Bellow follows the life of Augie March, an ambitious young man navigating the complexities of early 20th-century America. Through a series of adventures and encounters, the narrative explores themes of identity, freedom, and the pursuit of the American Dream."
  },
  {
    "title": "The Epic Of Gilgamesh",
    "author": "Unknown",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"The Epic of Gilgamesh\" is an ancient Mesopotamian poem that follows the journey of Gilgamesh, the semi-divine King of Uruk, as he seeks immortality and confronts the realities of human existence. Through encounters with gods, monsters, and his profound friendship with Enkidu, the tale explores themes of friendship, adventure, and the inevitable nature of death."
  },
  {
    "title": "Life, a User's Manual",
    "author": "Georges Perec",
    "category": "000 Generalities",
    "genre": "Encyclopedic",
    "description": "\"Life, a User's Manual\" by Georges Perec is a meticulous narrative that explores the lives of the residents of an apartment building in Paris, weaving together their stories in intricate detail. The novel employs a unique structural approach, mirroring the complexity of human life and memory, while reflecting Perec's fascination with the ordinary and the mundane."
  },
  {
    "title": "Darkness at Noon",
    "author": "Arthur Koestler",
    "category": "800 Literature",
    "genre": "Dystopian",
    "description": "\"Darkness at Noon\" by Arthur Koestler is a powerful novel that explores the psychological and moral dilemmas faced by a committed Communist, Rubashov, as he navigates the brutal political climate of the Soviet Union during the Great Purge. Through his imprisonment and interrogation, the story delves into themes of ideology, loyalty, and the cost of totalitarianism on the human spirit."
  },
  {
    "title": "The Chronicles of Narnia",
    "author": "C. S. Lewis",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"The Chronicles of Narnia\" by C.S. Lewis is a beloved fantasy series that follows the adventures of children who discover the magical land of Narnia, where talking animals and mythical creatures exist under the reign of the noble lion Aslan. The stories explore themes of bravery, redemption, and the battle between good and evil, enchanting readers of all ages with their rich allegories and imaginative world."
  },
  {
    "title": "The Power and the Glory",
    "author": "Graham Greene",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Power and the Glory\" by Graham Greene tells the story of a guilt-ridden whiskey priest in Mexico during a time of religious persecution, grappling with his faith and moral failings as he tries to escape capture. Through his journey, the novel explores themes of redemption, sin, and the complexity of human nature amidst a backdrop of political turmoil."
  },
  {
    "title": "The Shining",
    "author": "Stephen King",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Shining\" by Stephen King follows Jack Torrance, a struggling writer and recovering alcoholic, as he takes a job as the winter caretaker of the haunted Overlook Hotel. As supernatural forces begin to manipulate Jack's mind, his young son Danny's psychic abilities reveal the hotel's dark past, leading to a terrifying climax that tests the limits of sanity and family bonds."
  },
  {
    "title": "The Radetzky March",
    "author": "Joseph Roth",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Radetzky March\" by Joseph Roth is a poignant tale set against the backdrop of the Austro-Hungarian Empire, exploring the decline of the imperial order through the lives of the Trotta family across three generations. The novel poignantly captures themes of loyalty, nostalgia, and the inevitable passage of time as personal and political histories intersect."
  },
  {
    "title": "Are You There God? It's Me, Margaret",
    "author": "Judy Blume",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Are You There God? It's Me, Margaret\" by Judy Blume follows the journey of a pre-teen girl named Margaret Simon as she navigates the challenges of adolescence, including her feelings about religion, friendships, and the onset of puberty. Through her heartfelt conversations with God, Margaret seeks guidance and understanding in a complex world, making the novel a relatable exploration of growing up."
  },
  {
    "title": "Nostromo",
    "author": "Joseph Conrad",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Nostromo\" by Joseph Conrad is a complex novel that explores the themes of imperialism and capitalism through the story of a valuable silver mine in the fictional South American country of Costaguana. The narrative weaves together the lives of various characters, revealing how the quest for wealth and power corrupts both individuals and societies."
  },
  {
    "title": "Babbitt",
    "author": "Sinclair Lewis",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Babbitt\" by Sinclair Lewis is a satirical novel that follows the life of George F. Babbitt, a successful real estate broker in the fictional midwestern city of Zenith. Through Babbitt's experiences and struggles with conformity, materialism, and the search for meaning, the novel critiques American middle-class society in the 1920s."
  },
  {
    "title": "Look Homeward, Angel",
    "author": "Thomas Wolfe",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Look Homeward, Angel\" is a semi-autobiographical novel by Thomas Wolfe that follows the tumultuous life of young Eugene Gant as he navigates the complexities of family, identity, and the quest for meaning in early 20th-century America. Set in the fictional town of Altamont, the narrative explores themes of longing, aspiration, and the challenges of growing up against the backdrop of a changing society."
  },
  {
    "title": "Life and Fate",
    "author": "Vasily Grossman",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Life and Fate\" by Vasily Grossman is an epic novel that interweaves the personal lives of a diverse cast of characters against the backdrop of the Battle of Stalingrad during World War II. Through its rich narrative, the book explores themes of love, humanity, and the struggle between individual freedom and totalitarianism, ultimately reflecting on the moral complexities of life in wartime."
  },
  {
    "title": "Independent People",
    "author": "Halldor Laxness",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Independent People\" by Halldór Laxness tells the story of Bjartur, a sheep farmer in rural Iceland who fiercely values self-sufficiency and independence amidst the harsh realities of life. The novel explores themes of resilience, poverty, and the human spirit's struggle against societal and environmental challenges, all set against the backdrop of Icelandic landscapes and culture."
  },
  {
    "title": "Thus Spake Zarathustra",
    "author": "Friedrich Nietzsche",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Thus Spake Zarathustra\" is a philosophical work by Friedrich Nietzsche that explores the ideas of the Übermensch, eternal recurrence, and the revaluation of morals through the narrative of Zarathustra, a prophet-like figure who descends from solitude to impart his wisdom to humanity. The book is structured as a series of poetic speeches and reflections, challenging conventional beliefs and advocating for individualism, self-overcoming, and the embrace of life’s inherent struggles."
  },
  {
    "title": "The Waves",
    "author": "Virginia Woolf",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "\"The Waves\" by Virginia Woolf is a groundbreaking modernist novel that explores the inner lives and interconnectedness of six friends through their poetic monologues, reflecting on themes of identity, time, and the nature of consciousness. The narrative unfolds like a symphony, with each character's voice contributing to a rich tapestry that captures the ebb and flow of life, memory, and the human experience."
  },
  {
    "title": "Naked Lunch",
    "author": "William S. Burroughs",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"Naked Lunch\" by William S. Burroughs is a groundbreaking and controversial novel that explores the fragmented consciousness of drug addiction, sexuality, and societal control through a non-linear narrative. Utilizing vivid and often surreal imagery, Burroughs challenges conventional storytelling and delves into the darker aspects of the human experience."
  },
  {
    "title": "The Alexandria Quartet",
    "author": "Lawrence Durrell",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Alexandria Quartet\" by Lawrence Durrell is a literary tetralogy set in the city of Alexandria, Egypt, exploring the complex interrelationships between its characters through shifting perspectives and rich, evocative prose. The series delves into themes of love, betrayal, and the nature of reality, offering a vivid portrayal of the city’s cultural and political landscape during the tumultuous years before World War II."
  },
  {
    "title": "The Confessions of Jean-Jacques Rousseau",
    "author": "Jean-Jacques Rousseau",
    "category": "800 Literature",
    "genre": "Autobiography",
    "description": "\"The Confessions of Jean-Jacques Rousseau\" is an autobiographical work in which the philosopher candidly explores his life, thoughts, and emotions, emphasizing personal experiences and self-examination. It is notable for its pioneering nature in the realm of modern autobiographies, reflecting Rousseau's belief in the importance of authenticity and individual perspective."
  },
  {
    "title": "A Hero of Our Time",
    "author": "Mikhail Lermontov",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"A Hero of Our Time\" by Mikhail Lermontov is a pivotal work in Russian literature that explores the complex nature of the Byronic hero through its enigmatic protagonist, Pechorin. Set against the backdrop of 19th-century Caucasus, the novel intertwines a series of interconnected stories that reveal Pechorin's existential struggles, romantic entanglements, and the moral ambiguities of a disillusioned young man."
  },
  {
    "title": "A Tree Grows in Brooklyn",
    "author": "Betty Smith",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"A Tree Grows in Brooklyn\" by Betty Smith is a coming-of-age novel set in the early 20th century, following the life of Francie Nolan, a young girl growing up in the impoverished neighborhoods of Williamsburg, Brooklyn. Through her struggles and aspirations amidst the challenges of poverty and family dynamics, the story explores themes of resilience, hope, and the pursuit of dreams."
  },
  {
    "title": "The Lover",
    "author": "Marguerite Duras",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Lover\" by Marguerite Duras is a semi-autobiographical novel set in 1920s French colonial Vietnam, exploring the passionate and tumultuous love affair between a young French girl and a wealthy Chinese lover. Through lyrical prose, Duras delves into themes of desire, social constraints, and the complexities of identity and memory."
  },
  {
    "title": "Gravity's Rainbow",
    "author": "Thomas Pynchon",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Gravity's Rainbow\" by Thomas Pynchon is a complex, sprawling novel set during the final months of World War II, intertwining themes of technology, paranoia, and the search for meaning amidst chaos. The narrative centers on the development and impact of the V-2 rocket, exploring the interconnected lives of a diverse cast of characters as they navigate a surreal and often bewildering landscape of conspiracy and fate."
  },
  {
    "title": "The Left Hand Of Darkness",
    "author": "Ursula K. Le Guin",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Left Hand of Darkness\" by Ursula K. Le Guin explores themes of gender and sexuality through the story of Genly Ai, an envoy from the Ekumen, who travels to the planet Gethen, where inhabitants are ambisexual and can change gender. As he navigates the complexities of Gethenian society and forms an unexpected bond with the flawed yet captivating character Estraven, the novel challenges societal norms and invites readers to reconsider the nature of identity and human connection."
  },
  {
    "title": "The Time Machine",
    "author": "H. G. Wells",
    "category": "800 Literature",
    "genre": "Dystopian",
    "description": "\"The Time Machine\" by H.G. Wells follows an unnamed protagonist, known as the Time Traveler, who invents a machine that allows him to journey into the distant future. As he explores the vastly changed world inhabited by the Eloi and Morlocks, he grapples with themes of evolution, social class, and the consequences of human progress."
  },
  {
    "title": "Herzog",
    "author": "Saul Bellow",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Herzog\" by Saul Bellow follows Moses Herzog, a neurotic intellectual in his forties who grapples with personal crises, failed relationships, and existential questions. Through a series of letters to friends, family, and historical figures, Herzog navigates his inner turmoil and seeks meaning in a chaotic world."
  },
  {
    "title": "Bonfire of the Vanities",
    "author": "Tom Wolfe",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"Bonfire of the Vanities\" by Tom Wolfe is a satirical novel that explores the excesses and moral complexities of 1980s New York City, focusing on the life of a wealthy bond trader, Sherman McCoy. As he becomes embroiled in a hit-and-run incident and faces the media frenzy and racial tensions that follow, the novel critiques societal values, ambition, and the pursuit of power."
  },
  {
    "title": "The Call of the Wild",
    "author": "Jack London",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"The Call of the Wild\" by Jack London is a gripping tale of Buck, a domesticated dog who is thrust into the brutal life of the Yukon wilderness during the Klondike Gold Rush. As he navigates the challenges of survival and learns to embrace his primal instincts, Buck undergoes a transformative journey, ultimately discovering his true nature and place in the wild."
  },
  {
    "title": "Pippi Longstocking",
    "author": "Astrid Lindgren",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"Pippi Longstocking,\" written by Astrid Lindgren, follows the adventurous and unconventional young girl, Pippi, who lives alone in a house with her horse and monkey. With her wild red hair, unmatched strength, and a penchant for mischief, Pippi challenges societal norms and embraces a life full of imagination and freedom, captivating readers with her indomitable spirit."
  },
  {
    "title": "Foundation",
    "author": "Isaac Asimov",
    "category": "800 Literature",
    "genre": "Dystopian",
    "description": "\"Foundation\" by Isaac Asimov is a science fiction novel that follows the decline and fall of the Galactic Empire, predicting a dark age to come. To counter this inevitability, mathematician Hari Seldon establishes the Foundation, a group tasked with preserving knowledge and culture to shorten the impending darkness and pave the way for a new empire."
  },
  {
    "title": "The Posthumous Memoirs of Bras Cubas",
    "author": "Machado de Assis",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Posthumous Memoirs of Brás Cubas\" is a groundbreaking novel by Machado de Assis that features a deceased narrator reflecting on his life and the society around him. Through a blend of irony and social commentary, the book explores themes of vanity, the futility of existence, and the absurdity of human ambition in 19th-century Brazil."
  },
  {
    "title": "The Ambassadors",
    "author": "Henry James",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Ambassadors\" by Henry James follows Lambert Strether, a middle-aged American man sent to Paris to retrieve his young fiancée's son, Chad, who is immersed in the expatriate lifestyle. As Strether navigates the complexities of European culture and relationships, he grapples with themes of morality, identity, and the transformative power of experience."
  },
  {
    "title": "The Complete Stories of Flannery O'Connor",
    "author": "Flannery O'Connor",
    "category": "800 Literature",
    "genre": "Dark Humor",
    "description": "\"The Complete Stories of Flannery O'Connor\" encompasses the entirety of the celebrated Southern Gothic author's short fiction, showcasing her mastery of dark humor, religious themes, and complex characters. Through vivid storytelling, O'Connor explores the depths of human nature and the struggle for grace in a flawed world."
  },
  {
    "title": "The Pickwick Papers",
    "author": "Charles Dickens",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Pickwick Papers,\" Charles Dickens' first novel, follows the whimsical adventures of Samuel Pickwick and his companions as they travel across England, documenting their observations and experiences. Through a blend of humor and social commentary, the book presents a vivid portrayal of Victorian society and the eccentric characters they encounter along the way."
  },
  {
    "title": "The Strange Case of Dr. Jekyll and Mr. Hyde",
    "author": "Robert Louis Stevenson",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Strange Case of Dr. Jekyll and Mr. Hyde\" by Robert Louis Stevenson explores the duality of human nature through the story of Dr. Jekyll, a respected scientist who creates a potion that transforms him into the sinister Mr. Hyde. As Hyde commits increasingly violent acts, the narrative delves into themes of identity, morality, and the struggle between good and evil within a single person."
  },
  {
    "title": "Nightwood",
    "author": "Djuna Barnes",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "\"Nightwood\" by Djuna Barnes is a modernist novel that explores the complexities of love, identity, and the lives of marginalized characters in the 1920s. Through its lyrical prose and rich symbolism, the narrative delves into the themes of desire and existential despair, primarily centering on the passionate and tumultuous relationship between its central characters."
  },
  {
    "title": "Oresteia",
    "author": "Aeschylus",
    "category": "900 History & Geography",
    "genre": "Ancient",
    "description": "\"Oresteia\" is a trilogy of Greek tragedies by Aeschylus that chronicles the cycle of vengeance within the House of Atreus, beginning with the sacrifice of Agamemnon and culminating in the trial of his son Orestes. The plays explore themes of justice, revenge, and the transition from personal retribution to organized legal systems, highlighting the evolution of societal order."
  },
  {
    "title": "The House of the Spirits",
    "author": "Isabel Allende",
    "category": "800 Literature",
    "genre": "Family & Relationships",
    "description": "\"The House of the Spirits\" by Isabel Allende chronicles the multi-generational saga of the Trueba family, intertwining personal and political struggles in Chile against the backdrop of social upheaval. Blending magical realism with historical narrative, the novel explores themes of love, power, and the impact of the past on the future."
  },
  {
    "title": "The Year of Magical Thinking",
    "author": "Joan Didion",
    "category": "800 Literature",
    "genre": "Family & Relationships",
    "description": "\"The Year of Magical Thinking\" by Joan Didion is a poignant memoir that explores the author's profound grief following the sudden death of her husband, John Gregory Dunne, and the illness of their only daughter, Quintana. Through deeply introspective reflections, Didion examines the complexities of mourning, memory, and the resilience of the human spirit in the face of loss."
  },
  {
    "title": "The Death of Ivan Ilyich",
    "author": "Leo Tolstoy",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Death of Ivan Ilyich\" by Leo Tolstoy explores the existential crisis of a high-ranking judge confronted with his terminal illness. Through Ivan's tumultuous journey towards acceptance of death, the novel delves into themes of authenticity, the superficiality of societal norms, and the search for true meaning in life."
  },
  {
    "title": "The Autobiography of Alice B. Toklas",
    "author": "Gertrude Stein",
    "category": "800 Literature",
    "genre": "Biography",
    "description": "\"The Autobiography of Alice B. Toklas\" is a unique memoir written by Gertrude Stein that centers on her life and experiences in early 20th-century Paris, narrated through the perspective of her partner, Alice B. Toklas. The book offers a vibrant portrayal of the avant-garde movements of the time and the prominent artists and writers they mingled with, combining personal anecdotes with sharp cultural observations."
  },
  {
    "title": "Winesburg, Ohio",
    "author": "Sherwood Anderson",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Winesburg, Ohio,\" written by Sherwood Anderson, is a collection of interconnected short stories that explore the lives of the inhabitants of a small Midwestern town. Through vivid character sketches, the book delves into themes of loneliness, isolation, and the complex inner lives of ordinary people in the early 20th century."
  },
  {
    "title": "Leviathan",
    "author": "Thomas Hobbes",
    "category": "800 Literature",
    "genre": "Nonfiction",
    "description": "\"Leviathan,\" written by Thomas Hobbes in 1651, is a foundational text in political philosophy that argues for the necessity of a powerful sovereign authority to prevent the chaos and violence of human nature in the absence of governance. Through a social contract theory, Hobbes asserts that individuals must surrender certain freedoms to a central authority to ensure peace and security within society."
  },
  {
    "title": "Man's Search for Meaning",
    "author": "Viktor Frankl",
    "category": "300 Social Sciences",
    "genre": "Counselling",
    "description": "\"Man's Search for Meaning\" by Viktor Frankl chronicles the author’s experiences as a Holocaust survivor and explores the importance of finding purpose in life, even amidst suffering. It combines personal narrative with psychological insights, emphasizing that the search for meaning is a fundamental human motivation that can lead to resilience and personal growth."
  },
  {
    "title": "Wings of the Dove",
    "author": "Henry James",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Wings of the Dove\" by Henry James follows the complex relationship between Milly Theale, a wealthy American heiress, and two scheming friends, Kate Croy and Merton Densher, who manipulate her situation to gain access to her fortune. The novel intricately explores themes of love, sacrifice, and moral ambiguity as the characters navigate their desires and the implications of their choices."
  },
  {
    "title": "Lucky Jim",
    "author": "Kingsley Amis",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Lucky Jim\" by Kingsley Amis follows Jim Dixon, a disenchanted young lecturer, as he navigates the absurdities of academic life and struggles with his own identity and relationships. Through witty satire and sharp commentary, the novel explores themes of class, conformity, and the pursuit of personal authenticity in a post-war British society."
  },
  {
    "title": "Song of Solomon",
    "author": "Toni Morrison",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Song of Solomon\" by Toni Morrison follows the life of Macon \"Milkman\" Dead III, an African American man living in Michigan who embarks on a quest to uncover his family's history and cultural roots. Through lyrical prose and rich symbolism, the novel explores themes of identity, heritage, and the significance of personal and collective memory."
  },
  {
    "title": "Cry, the Beloved Country",
    "author": "Alan Paton",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Cry, the Beloved Country\" by Alan Paton is a poignant exploration of racial and social injustice in South Africa during the 1940s, focusing on the journey of a rural Zulu pastor, Stephen Kumalo, as he searches for his son in Johannesburg. The novel delves into themes of family, forgiveness, and the profound impact of apartheid on individuals and society, ultimately calling for compassion and understanding in a fractured world."
  },
  {
    "title": "The Good Earth",
    "author": "Pearl S. Buck",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Good Earth\" by Pearl S. Buck follows the life of Wang Lung, a Chinese farmer, as he navigates the challenges of poverty, wealth, and family dynamics in a changing society. The novel explores themes of resilience, the connection to the land, and the complexities of human relationships against the backdrop of early 20th-century China."
  },
  {
    "title": "Mahabharata",
    "author": "Vyasa",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "The Mahabharata, attributed to the sage Vyasa, is an ancient Indian epic that narrates the complex saga of the Kurukshetra War between the Pandavas and Kauravas, exploring themes of duty, righteousness, and moral dilemmas. Alongside its central narrative, it encompasses a wealth of philosophical and devotional material, including the revered Bhagavad Gita, which offers profound insights into ethics and the human condition."
  },
  {
    "title": "Father Goriot",
    "author": "Honoré de Balzac",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Father Goriot\" is a novel set in early 19th-century Paris that explores the lives of residents in a boarding house, with a particular focus on the sacrifices made by an aging father, Goriot, for the success of his daughters. Through the lens of social ambition and personal tragedy, Balzac examines themes of family, love, and the harsh realities of societal expectations."
  },
  {
    "title": "The Private Memoirs and Confessions of a Justified Sinner",
    "author": "James Hogg",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Private Memoirs and Confessions of a Justified Sinner\" by James Hogg is a complex narrative that explores themes of religious fanaticism, guilt, and the duality of human nature through the story of a young man, Robert Wringham. Set in 18th-century Scotland, the novel presents a chilling interplay between free will and predestination, as Wringham grapples with his perceived status as one of the \"elect,\" leading him down a dark path of self-destruction and moral ambiguity."
  },
  {
    "title": "White Noise",
    "author": "Don DeLillo",
    "category": "800 Literature",
    "genre": "Dark",
    "description": "\"White Noise\" by Don DeLillo explores the pervasive influence of technology, media, and consumer culture on modern life through the lens of Jack Gladney, a professor of Hitler Studies. As he navigates his family's dynamics and the omnipresent background noise of society, the novel delves into themes of mortality, fear, and the search for meaning in a world saturated with information."
  },
  {
    "title": "Labyrinths",
    "author": "Jorge Luis Borges",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Labyrinths\" is a collection of thought-provoking short stories by Jorge Luis Borges, exploring complex themes of infinity, identity, and the nature of reality. Through intricate narratives and philosophical reflections, Borges invites readers into a labyrinthine world where the boundaries between fiction and reality blur."
  },
  {
    "title": "The Wind-Up Bird Chronicle",
    "author": "Haruki Murakami",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "\"The Wind-Up Bird Chronicle\" by Haruki Murakami follows Toru Okada, an aimless Tokyo man who embarks on a surreal journey to find his missing wife, Kumiko. As he encounters a cast of intriguing characters and navigates a labyrinth of dreams and reality, the narrative explores themes of loneliness, loss, and the search for identity."
  },
  {
    "title": "Where the Wild Things Are",
    "author": "Maurice Sendak",
    "category": "800 Literature",
    "genre": "Children's books",
    "description": "\"Where the Wild Things Are\" by Maurice Sendak tells the story of a young boy named Max who, after causing mischief and dressing in a wolf costume, is sent to his room without supper. In his imagination, he sails to an island inhabited by wild creatures known as the Wild Things, where he becomes their king before ultimately returning home to find love and comfort."
  },
  {
    "title": "A Dance to the Music of Time",
    "author": "Anthony Powell",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"A Dance to the Music of Time\" is a twelve-volume series by Anthony Powell that intricately explores the lives, relationships, and social dynamics of a group of characters in 20th-century England. Through a richly woven narrative, the series captures the passage of time, generational change, and the nuances of human interaction against the backdrop of historical events."
  },
  {
    "title": "Kim",
    "author": "Rudyard Kipling",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"Kim\" by Rudyard Kipling follows the adventures of a young orphaned boy in British-occupied India, who navigates cultural and political landscapes as he befriends a Tibetan Lama and becomes embroiled in the Great Game, a geopolitical conflict between Britain and Russia. The novel explores themes of identity, loyalty, and the rich tapestry of Indian society through Kim's journey of self-discovery and espionage."
  },
  {
    "title": "Kristin Lavransdatter",
    "author": "Sigrid Undset",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Kristin Lavransdatter,\" written by Sigrid Undset, follows the life of its titular character, Kristin, as she navigates love, motherhood, and the societal expectations of 14th-century Norway. Through her struggles and personal growth, the novel explores themes of faith, identity, and the complexity of human relationships."
  },
  {
    "title": "Meditations",
    "author": "Marcus Aurelius",
    "category": "900 History & Geography",
    "genre": "Ancient",
    "description": "\"Meditations\" by Marcus Aurelius is a collection of personal writings that reflect the Stoic philosophy practiced by the Roman Emperor. In these reflections, Aurelius contemplates the nature of life, the importance of virtue, and how to maintain inner peace amid external chaos."
  },
  {
    "title": "The Poems of Robert Frost",
    "author": "Robert Frost",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Poems of Robert Frost\" is a collection that showcases the depth and beauty of nature and rural life, reflecting the complexities of human emotions and relationships. Frost's mastery of language and vivid imagery draws readers into a world where personal experiences are intricately woven with the changing seasons and landscapes of New England."
  },
  {
    "title": "The Structure of Scientific Revolutions",
    "author": "Thomas Kuhn",
    "category": "800 Literature",
    "genre": "Nonfiction",
    "description": "\"The Structure of Scientific Revolutions\" by Thomas Kuhn argues that scientific progress is not a gradual accumulation of knowledge but occurs through a series of paradigm shifts, where existing frameworks are replaced by new ones in response to anomalies. Kuhn's concept of \"normal science\" versus \"revolutionary science\" reshapes our understanding of how scientific fields evolve and adapt over time."
  },
  {
    "title": "The Princess of Cleves",
    "author": "Madame de La Fayette",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Princess of Cleves,\" authored by Madame de La Fayette, is a classic 17th-century French novel that explores themes of love, duty, and the complexities of court life in the French royal court. The story follows the titular character, a young noblewoman, as she grapples with her feelings for a dashing suitor while remaining committed to her husband, ultimately highlighting the struggles between personal desire and societal expectations."
  },
  {
    "title": "Infinite Jest",
    "author": "David Foster Wallace",
    "category": "800 Literature",
    "genre": "Dark",
    "description": "\"Infinite Jest\" by David Foster Wallace is a complex, sprawling novel that intertwines the lives of individuals at an elite tennis academy and a nearby drug and alcohol rehabilitation center. The narrative explores themes of addiction, entertainment, and the search for meaning in a hyper-mediated society, all while employing a distinctive non-linear structure and rich, challenging prose."
  },
  {
    "title": "Homage to Catalonia",
    "author": "George Orwell",
    "category": "800 Literature",
    "genre": "Memoir",
    "description": "\"Homage to Catalonia\" is George Orwell's first-hand account of his experiences during the Spanish Civil War, where he fought for the Republican side against Franco's fascist forces. Through his poignant narrative, Orwell explores the complexities of ideology, the betrayal of socialist ideals, and the harsh realities of war, offering profound insights into the political landscape of the time."
  },
  {
    "title": "The Daughter of Time",
    "author": "Josephine Tey",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"The Daughter of Time\" by Josephine Tey is a historical mystery novel featuring Inspector Alan Grant, who, while recovering in a hospital, becomes intrigued by the controversial figure of King Richard III. As he investigates the circumstances surrounding Richard's alleged crimes, particularly the supposed murder of the Princes in the Tower, Grant challenges the established historical narratives, ultimately seeking the truth behind the infamous monarch’s reputation."
  },
  {
    "title": "Fear and Loathing in Las Vegas",
    "author": "Hunter S. Thompson",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"Fear and Loathing in Las Vegas\" by Hunter S. Thompson is a seminal work of gonzo journalism that follows the chaotic and drug-fueled journey of Raoul Duke and his lawyer Dr. Gonzo as they embark on a surreal quest to attend a motorcycle race in Las Vegas. The narrative blends dark humor and social commentary, exploring themes of excess, the American Dream, and the disillusionment of the 1970s counterculture."
  },
  {
    "title": "I Know Why the Caged Bird Sings",
    "author": "Maya Angelou",
    "category": "800 Literature",
    "genre": "Autobiography",
    "description": "\"I Know Why the Caged Bird Sings\" is a powerful autobiography by Maya Angelou that chronicles her early years growing up in the racially segregated South. Through her experiences of trauma, resilience, and self-discovery, Angelou explores themes of identity, empowerment, and the profound impact of literature and love in overcoming adversity."
  },
  {
    "title": "The God of Small Things",
    "author": "Arundhati Roy",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"The God of Small Things\" by Arundhati Roy explores the intertwining lives of fraternal twins Rahel and Estha as they navigate the complex social and familial landscapes of Kerala, India. Through a non-linear narrative, the novel delves into themes of love, loss, and the impact of societal norms on personal relationships, ultimately revealing how small events can have profound consequences."
  },
  {
    "title": "Death in Venice",
    "author": "Thomas Mann",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Death in Venice\" by Thomas Mann tells the story of Gustav von Aschenbach, a renowned but introspective writer who becomes infatuated with a beautiful Polish boy named Tadzio while vacationing in Venice. As Aschenbach grapples with his desire and the looming threat of a cholera outbreak, the novel explores themes of obsession, beauty, and the inevitability of decay."
  },
  {
    "title": "The Awakening",
    "author": "Kate Chopin",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Awakening\" by Kate Chopin is a novel that follows Edna Pontellier, a young woman in late 19th-century Louisiana, as she grapples with her roles as wife and mother while seeking independence and self-discovery. Through her journey of sexual and personal awakening, Edna challenges societal norms, ultimately leading her to confront the limitations imposed upon her by society."
  },
  {
    "title": "The Unnamable",
    "author": "Samuel Beckett",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"The Unnamable\" by Samuel Beckett is a profound and introspective novel that delves into themes of existence, identity, and the nature of consciousness through the fragmented thoughts of an unnamed narrator. The narrative is marked by its surreal style, blending philosophical inquiry with a deep sense of existential uncertainty, ultimately questioning the limits of language and self-expression."
  },
  {
    "title": "The Garden of the Finzi-Continis",
    "author": "Giorgio Bassani",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Garden of the Finzi-Continis\" by Giorgio Bassani explores the lives of a wealthy Jewish family in 1930s Italy, highlighting the tensions and social changes leading up to World War II. Through the eyes of a young narrator, the novel delves into themes of love, loss, and the impact of fascism on personal lives and idyllic beauty."
  },
  {
    "title": "A Room With a View",
    "author": "E. M. Forster",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"A Room with a View\" by E. M. Forster is a novel that explores the clash between societal conventions and personal desires through the story of Lucy Honeychurch, a young woman torn between her dreams of passionate love and the expectations of Edwardian society. Set in both the picturesque landscape of Italy and the stifling environment of England, the narrative delves into themes of self-discovery, social class, and the pursuit of true happiness."
  },
  {
    "title": "At Swim Two-Birds",
    "author": "Flann O'Brien",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"At Swim-Two-Birds\" by Flann O'Brien is a metafictional novel that weaves together the stories of a young man, his narrative experiments, and the characters from his unfinished tales, including a writer struggling to maintain control over his creations. Blending humor, myth, and literary playfulness, O'Brien explores themes of identity, authorship, and the blurred boundaries between fiction and reality."
  },
  {
    "title": "Gilead",
    "author": "Marilynne Robinson",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Gilead\" is a novel by Marilynne Robinson that takes the form of a heartfelt letter from John Ames, a 76-year-old pastor in a small Iowa town, to his young son. Through reflections on his life, family history, and faith, Ames explores themes of spirituality, mortality, and the complexity of human relationships in an intimate and poignant manner."
  },
  {
    "title": "My Brilliant Friend",
    "author": "Elena Ferrante",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"My Brilliant Friend\" is the first book in Elena Ferrante's acclaimed Neapolitan Quartet, exploring the intense and complex friendship between two girls, Elena and Lila, as they grow up in a poor neighborhood in post-war Naples. Through their intertwined lives, the novel delves into themes of identity, ambition, and the socio-cultural challenges faced by women in a patriarchal society."
  },
  {
    "title": "The Confusions of Young Törless",
    "author": "Robert Musil",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Confusions of Young Törless\" by Robert Musil follows the intellectual and emotional struggles of a young student, Törless, at a military boarding school in late 19th-century Austria. As he grapples with issues of identity, morality, and the complexities of human relationships, Törless is drawn into the dark undercurrents of bullying and power dynamics among his peers."
  },
  {
    "title": "La Regenta",
    "author": "Clarín",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"La Regenta,\" written by Leopoldo Alas \"Clarín,\" is a novel set in the fictional Spanish town of Vetusta, exploring the life of the young and beautiful Ana Ozores, who struggles with the confines of provincial society and her own desires. The narrative intricately weaves themes of passion, morality, and social hypocrisy through the lens of a woman's quest for autonomy in a repressive environment."
  },
  {
    "title": "The Old Wives' Tale",
    "author": "Arnold Bennett",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Old Wives' Tale\" by Arnold Bennett explores the lives of two sisters, Constance and Sophia Trotter, who navigate the challenges of their small-town existence in the English Midlands. Spanning several decades, the novel delves into themes of love, sacrifice, and the passage of time, ultimately contrasting the sisters' divergent paths and their responses to life's circumstances."
  },
  {
    "title": "The Human Stain",
    "author": "Philip Roth",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"The Human Stain\" by Philip Roth is a poignant exploration of identity, race, and societal hypocrisy, centered around Coleman Silk, a Jewish professor whose life unravels after a racially charged incident. As he seeks to redefine himself and escape the consequences of his past, the novel delves into themes of secrecy, the complexities of human relationships, and the burden of personal and cultural history."
  },
  {
    "title": "The Betrothed",
    "author": "Alessandro Manzoni",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"The Betrothed\" (originally \"I Promessi Sposi\") by Alessandro Manzoni is a historical novel set in 17th-century Italy, following the tumultuous love story of Renzo and Lucia as they navigate societal injustices and personal trials. Through their struggles against tyranny and fate, the novel explores themes of faith, redemption, and the impact of history on individual lives."
  },
  {
    "title": "The Lost Estate",
    "author": "Henri Alain-Fournier",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Lost Estate\" by Henri Alain-Fournier is a poignant coming-of-age novel set in the idyllic French countryside, where a young boy named François explores themes of nostalgia and the bittersweet nature of memory. The story artfully weaves together youthful innocence, love, and the inevitable passage of time, capturing the essence of a lost paradise that remains forever in the heart."
  },
  {
    "title": "If on a Winter's Night a Traveller",
    "author": "Italo Calvino",
    "category": "800 Literature",
    "genre": "Books About Books",
    "description": "\"If on a Winter's Night a Traveler\" by Italo Calvino is a metafictional novel that immerses the reader in the experience of reading as it follows a reader's journey through ten distinct narratives, each interrupted and incomplete. The book blurs the boundaries between fiction and reality, exploring themes of identity, authorship, and the nature of storytelling itself."
  },
  {
    "title": "The Mill on the Floss",
    "author": "George Eliot",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Mill on the Floss\" by George Eliot follows the lives of siblings Maggie and Tom Tulliver as they navigate the complexities of family, societal expectations, and personal aspirations in the fictional English town of St. Ogg’s. Through their struggles with love, loss, and the constraints of their environment, the novel explores themes of self-identity, conflict, and the yearning for freedom."
  },
  {
    "title": "The Savage Detectives",
    "author": "Roberto Bolaño",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "\"The Savage Detectives\" by Roberto Bolaño is a novel that follows the quest of a young writer named Juan Guerra as he seeks out the enigmatic poets of the Visceral Realism movement, led by the elusive Ulises Lima and Arturo Belano. Blending elements of literary exploration and a raw, fragmented narrative style, the book captures the vibrant and tumultuous world of 1970s Mexico City and the lives of those who inhabit it."
  },
  {
    "title": "Speak, Memory",
    "author": "Vladimir Nabokov",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Speak, Memory\" is a poignant autobiographical memoir by Vladimir Nabokov that explores his early life in Russia, his experiences of exile, and the intricate memories that shape his identity as a writer. Through lyrical prose, Nabokov delves into themes of nostalgia, the passage of time, and the interplay between memory and artistry, offering a unique glimpse into the mind of one of the 20th century's literary giants."
  },
  {
    "title": "Cold Comfort Farm",
    "author": "Stella Gibbons",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Cold Comfort Farm\" by Stella Gibbons is a satirical novel that follows Flora Poste, a young woman who, after becoming orphaned, decides to live with her eccentric relatives on a rural farm in Sussex. With a comedic and witty approach, Flora attempts to bring order and modernity to the chaotic lives of the farm's inhabitants, challenging their gloomy and rustic ways."
  },
  {
    "title": "Ivanhoe",
    "author": "Sir Walter Scott",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"Ivanhoe,\" written by Sir Walter Scott, is a historical novel set in 12th-century England, focusing on the adventures of the Saxon knight Wilfred of Ivanhoe as he navigates the conflicts between Saxons and Normans. Featuring themes of chivalry, romance, and loyalty, the story includes notable characters such as the valiant Robin Hood and the beautiful Rebecca, exploring the struggles against prejudice and oppression."
  },
  {
    "title": "The Stories of John Cheever",
    "author": "John Cheever",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Stories of John Cheever\" is a collection of narratives that capture the complexities of American suburban life, exploring themes of love, loneliness, and the search for identity. Through Cheever's poignant prose and keen observations, the stories delve into the nuances of human relationships and the often hidden struggles of everyday existence."
  },
  {
    "title": "Journey to the West",
    "author": "Wu Cheng'en",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"Journey to the West,\" attributed to Wu Cheng'en, is a classic Chinese novel that follows the pilgrimage of the monk Xuanzang as he travels to India to obtain Buddhist scriptures. Accompanied by a trio of supernatural protectors, including the mischievous Monkey King, Sun Wukong, the narrative blends adventure, spirituality, and rich allegory, exploring themes of loyalty, enlightenment, and the struggle between good and evil."
  },
  {
    "title": "The Mayor of Casterbridge",
    "author": "Thomas Hardy",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Mayor of Casterbridge\" by Thomas Hardy tells the story of Michael Henchard, a man who rises to prominence in the town of Casterbridge but is haunted by his past mistakes, particularly his impulsive decision to sell his wife and child in a fit of drunkenness. As his ambitions clash with his regrets and the complexities of human relationships, Henchard's tragic flaws ultimately lead to his downfall, exploring themes of fate, redemption, and the consequences of one's actions."
  },
  {
    "title": "Celestina Or The Tragic-Comedy Of Calisto And Melibea",
    "author": "Fernando de Rojas",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Celestina, or The Tragicomedy of Calisto and Melibea\" is a seminal Spanish work by Fernando de Rojas that intertwines themes of love, desire, and betrayal through the story of Calisto, who falls for the beautiful Melibea, and seeks the help of the cunning matchmaker Celestina. This complex narrative navigates the manipulations and tragic consequences of passion, ultimately revealing the darker sides of human nature and the societal implications of love."
  },
  {
    "title": "Wolf Hall",
    "author": "Hilary Mantel",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Wolf Hall\" by Hilary Mantel is a historical novel that explores the rise of Thomas Cromwell, a key figure in the court of King Henry VIII, during the tumultuous period of the English Reformation. Through Cromwell’s perspective, the novel delves into themes of power, ambition, and the complexities of loyalty in a rapidly changing political landscape."
  },
  {
    "title": "The Complete Works of Plato",
    "author": "Plato",
    "category": "800 Literature",
    "genre": "Mythological",
    "description": "\"The Complete Works of Plato\" encompasses the full range of writings attributed to the ancient Greek philosopher Plato, including his dialogues on ethics, politics, metaphysics, and epistemology. This compilation presents foundational ideas of Western philosophy, exploring themes such as the nature of justice, the ideal state, and the theory of forms through conversations primarily featuring Socrates."
  },
  {
    "title": "Housekeeping",
    "author": "Marilynne Robinson",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Housekeeping\" by Marilynne Robinson is a poignant exploration of memory, loss, and the complexities of family through the lives of two sisters, Ruth and Lucille, who are raised by their eccentric aunt in a small town in Idaho. The novel delves into themes of transience and the search for belonging, weaving together lyrical prose with deep existential reflections."
  },
  {
    "title": "The Adventures of Tom Sawyer",
    "author": "Mark Twain",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"The Adventures of Tom Sawyer\" by Mark Twain follows the mischievous and imaginative young boy, Tom Sawyer, as he navigates childhood adventures along the Mississippi River in the fictional town of St. Petersburg, Missouri. Through his exploits—ranging from pranks and pirate dreams to friendship and the quest for adventure—Tom learns valuable life lessons about morality, bravery, and the complexities of growing up."
  },
  {
    "title": "His Dark Materials",
    "author": "Philip Pullman",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"His Dark Materials\" by Philip Pullman is a fantasy trilogy that follows the journey of a young girl named Lyra Belacqua as she navigates parallel worlds, confronting complex themes of freedom, knowledge, and spirituality. The series intricately weaves together adventure, philosophy, and rich character development, culminating in a battle against oppressive forces that seek to control the very essence of existence."
  },
  {
    "title": "The Sorrows of Young Werther",
    "author": "Johann Wolfgang von Goethe",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Sorrows of Young Werther\" is a novel by Johann Wolfgang von Goethe that follows the intense emotional experiences of Werther, a young artist who becomes infatuated with a woman named Lotte, who is already engaged. Through his letters, Werther expresses his deep feelings of love, despair, and existential crisis, ultimately leading to his tragic fate."
  },
  {
    "title": "Tarzan of the Apes",
    "author": "Edgar Rice Burroughs",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"Tarzan of the Apes\" by Edgar Rice Burroughs follows the life of an orphaned child, raised by a tribe of apes in the African jungle, who discovers his true identity as the heir to a British lord. As he grapples with both his primal upbringing and the complexities of civilization, Tarzan navigates themes of identity, survival, and the clash between nature and culture."
  },
  {
    "title": "The General Theory of Employment, Interest and Money",
    "author": "John Maynard Keynes",
    "category": "800 Literature",
    "genre": "Nonfiction",
    "description": "\"The General Theory of Employment, Interest and Money,\" published in 1936 by John Maynard Keynes, revolutionizes economic thought by explaining how aggregate demand drives economic activity and employment levels. Keynes argues against the classical perspective that markets are always self-correcting, emphasizing the need for government intervention to stabilize economies during downturns."
  },
  {
    "title": "The Hollow Man",
    "author": "John Dickson Carr",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"The Hollow Man\" by John Dickson Carr is a classic murder mystery that features the brilliant detective Gideon Fell, who seeks to solve a seemingly impossible crime involving a man who disappears from a locked room. With its clever plotting and intricate puzzles, the novel explores themes of illusion and reality, showcasing Carr's mastery of the impossible crime genre."
  },
  {
    "title": "Go Tell it on the Mountain",
    "author": "James Baldwin",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Go Tell It on the Mountain\" by James Baldwin is a semi-autobiographical novel that explores the complexities of race, identity, and spirituality in 1930s America through the eyes of a young African American boy named John Grimes. Set in Harlem, the narrative delves into John's struggles with family dynamics, religious expectations, and his quest for self-understanding against a backdrop of societal challenges."
  },
  {
    "title": "The Things They Carried",
    "author": "Tim O'Brien",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Things They Carried\" by Tim O'Brien is a compelling blend of fiction and memoir that explores the physical and emotional burdens carried by soldiers during the Vietnam War. Through a series of interconnected stories, O'Brien delves into themes of memory, trauma, and the complexities of courage and guilt in the face of conflict."
  },
  {
    "title": "The Postman Always Rings Twice",
    "author": "James M. Cain",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"The Postman Always Rings Twice\" by James M. Cain is a noir novel that follows the passionate and destructive affair between Frank Chambers, a drifter, and Cora Papadakis, a married woman running a roadside diner. Their tumultuous relationship spirals into a plot of betrayal and murder, encapsulating themes of lust, desire, and the moral complexities of human nature."
  },
  {
    "title": "The Electric Kool-Aid Acid Test",
    "author": "Tom Wolfe",
    "category": "300 Social Sciences",
    "genre": "Americana",
    "description": "\"The Electric Kool-Aid Acid Test\" by Tom Wolfe chronicles the adventures of Ken Kesey and the Merry Pranksters as they embark on a cross-country trip in a colorful bus, exploring the psychedelic culture of the 1960s. Through vivid storytelling and immersive reportage, Wolfe captures the essence of the counterculture movement, the experimentation with LSD, and the quest for an expanded consciousness."
  },
  {
    "title": "History",
    "author": "Elsa Morante",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"History\" by Elsa Morante is a poignant novel set in Italy during World War II that explores the impact of war on individual lives and the broader social fabric. Through the experiences of its characters, particularly that of a Jewish woman and her child, the book delves into themes of love, loss, and the search for identity amidst chaos and brutality."
  },
  {
    "title": "Murder on the Orient Express",
    "author": "Agatha Christie",
    "category": "800 Literature",
    "genre": "Cozy",
    "description": "\"Murder on the Orient Express\" follows the renowned detective Hercule Poirot as he investigates a murder aboard the luxurious train traveling from Istanbul to Calais. As he interviews the eclectic group of passengers, Poirot uncovers hidden connections and motives, leading to a shocking revelation about the crime."
  },
  {
    "title": "Cloud Atlas",
    "author": "David Mitchell",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "\"Cloud Atlas\" by David Mitchell weaves together six interconnected stories spanning different timelines and genres, exploring themes of reincarnation, the impact of individual actions across time, and the struggle for freedom. Through its intricate narrative structure, the novel illustrates how lives are intertwined in a complex tapestry of human experience, raising profound questions about fate, moral responsibility, and the interconnectedness of existence."
  },
  {
    "title": "Black Lamb and Grey Falcon",
    "author": "Rebecca West",
    "category": "300 Social Sciences",
    "genre": "Cultural",
    "description": "\"Black Lamb and Grey Falcon\" by Rebecca West is a travelogue that chronicles her journey through Yugoslavia in the 1930s, blending historical analysis with personal observations. The narrative delves into the complex tapestry of Balkan cultures, politics, and history, reflecting on themes of nationalism, identity, and the deep-rooted tensions that define the region."
  },
  {
    "title": "The Phantom Tollbooth",
    "author": "Norton Juster",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"The Phantom Tollbooth\" by Norton Juster follows the whimsical adventure of a boy named Milo who discovers a magical tollbooth that takes him to the fantastical lands of Dictionopolis and Digitopolis. Through clever wordplay and imaginative challenges, Milo learns valuable lessons about curiosity, knowledge, and the joy of learning."
  },
  {
    "title": "Germinal",
    "author": "Émile Zola",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Germinal\" by Émile Zola is a powerful exploration of the struggles and hardships faced by coal miners in 19th-century France, highlighting the harsh realities of their working conditions and the socioeconomic injustices they endure. Through the story of Étienne Lantier, a young miner who becomes a catalyst for revolution and solidarity among the workers, Zola vividly portrays the themes of class conflict and human resilience."
  },
  {
    "title": "I, Claudius",
    "author": "Robert Graves",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"I, Claudius\" by Robert Graves is a historical novel presented as an autobiographical memoir of Roman Emperor Claudius, chronicling his life from his early years as an overlooked member of the Julio-Claudian dynasty to his eventual rise to power. Through Claudius's witty and insightful narrative, the book offers a vivid portrayal of the intrigue, betrayal, and political machinations of ancient Rome."
  },
  {
    "title": "Persepolis",
    "author": "Marjane Satrapi",
    "category": "700 Arts & Recreation",
    "genre": "Comics & Graphic Novels",
    "description": "\"Persepolis\" by Marjane Satrapi is a poignant graphic memoir that chronicles her childhood and early adulthood in Iran during and after the Islamic Revolution. Through stark black-and-white illustrations, Satrapi explores themes of identity, cultural heritage, and the impact of political upheaval on personal lives."
  },
  {
    "title": "A Visit From The Goon Squad",
    "author": "Jennifer Egan",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"A Visit from the Goon Squad\" by Jennifer Egan is a multi-faceted exploration of the lives of interconnected characters in the music industry, weaving together themes of aging, nostalgia, and the passage of time. The novel employs a unique narrative structure, featuring chapters that shift perspectives and styles, ultimately reflecting on the complexities of human relationships and the impact of technology on our lives."
  },
  {
    "title": "Hopscotch",
    "author": "Julio Cortazar",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "\"Hopscotch\" by Julio Cortázar is an experimental novel that follows Horacio Oliveira, an Argentine intellectual living in Paris, as he navigates love, existential crises, and the complexities of modern life. The narrative structure allows for multiple reading pathways, reflecting the novel's themes of fragmentation and the search for meaning in a chaotic world."
  },
  {
    "title": "Passing",
    "author": "Nella Larsen",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Passing\" by Nella Larsen explores the lives of two African American women, Clare Kendry and Irene Redfield, who navigate the complexities of racial identity and social status in 1920s America. As Clare chooses to \"pass\" as white, the novel delves into themes of friendship, betrayal, and the societal pressures that affect their lives and choices."
  },
  {
    "title": "Peter And Wendy",
    "author": "J. M. Barrie",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"Peter and Wendy\" by J.M. Barrie is a timeless tale that follows a young girl named Wendy Darling who journeys to the magical land of Neverland alongside Peter Pan, the mischievous boy who can fly and never grows up. Their adventure is filled with encounters with pirates, fairies, and other fantastical creatures, exploring themes of childhood, adventure, and the bittersweet nature of growing up."
  },
  {
    "title": "Oedipus at Colonus",
    "author": "Sophocles",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Oedipus at Colonus\" is a tragedy by Sophocles that follows the blind and exiled Oedipus as he seeks refuge in the sacred grove of Colonus near Athens. In his final days, he confronts his fate, reconciles with his past, and ultimately finds peace, underscoring themes of redemption, legacy, and the power of choice."
  },
  {
    "title": "Kolyma Stories",
    "author": "Varlam Shalamov",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Kolyma Stories\" is a collection of short stories by Varlam Shalamov that offers a harrowing portrayal of life in the Soviet labor camps of Kolyma, where Shalamov himself was imprisoned. Through vivid and often painful narratives, he explores the brutal realities of survival, the resilience of the human spirit, and the moral complexities faced by those living in such inhumane conditions."
  },
  {
    "title": "Ferdydurke",
    "author": "Witold Gombrowicz",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"Ferdydurke\" by Witold Gombrowicz is a novel that explores themes of maturity and identity through the absurd and surreal experiences of its protagonist, Joey, who is inexplicably pushed back into adolescence. The story critiques societal norms and the constraints of maturity, using humor and a non-linear narrative to challenge conventional perceptions of self and reality."
  },
  {
    "title": "The Devil to Pay in the Backlands",
    "author": "Joao Guimaraes Rosa",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Devil to Pay in the Backlands\" by João Guimarães Rosa is a landmark Brazilian novel that explores the intricate and often harsh realities of life in the hinterlands of Brazil through the eyes of a traveling protagonist, Riobaldo. Blending elements of folklore, philosophy, and rich regional dialect, the narrative delves into themes of fate, love, and the moral complexities of existence, creating a vivid portrayal of both the landscape and the human experience."
  },
  {
    "title": "The Brief Wondrous Life of Oscar Wao",
    "author": "Junot Diaz",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"The Brief Wondrous Life of Oscar Wao\" by Junot Díaz follows the life of Oscar de León, an eccentric Dominican-American nerd with dreams of becoming a famous writer and finding love, while grappling with a family curse that haunts his lineage. Through a blend of humor, tragedy, and rich cultural references, the novel explores themes of identity, diaspora, and the impact of history on personal lives."
  },
  {
    "title": "The Elements of Style",
    "author": "E. B. White, William Strunk Jr.",
    "category": "800 Literature",
    "genre": "Nonfiction",
    "description": "\"The Elements of Style\" is a classic guide to writing well, co-authored by William Strunk Jr. and E.B. White. It emphasizes the principles of clarity, simplicity, and brevity in writing, providing essential rules and recommendations for effective communication."
  },
  {
    "title": "A Death in the Family",
    "author": "James Agee",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"A Death in the Family\" by James Agee is a poignant semi-autobiographical novel that explores the profound impact of the sudden death of a father on a young boy and his family. Through lyrical prose and rich imagery, Agee captures the complexity of grief, memory, and the bittersweet nature of childhood."
  },
  {
    "title": "Clarissa",
    "author": "Samuel Richardson",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Clarissa,\" written by Samuel Richardson, is an epistolary novel that tells the tragic story of a virtuous young woman, Clarissa Harlowe, who becomes the target of manipulation and seduction by the unscrupulous Lovelace. Through her letters and those of others, the novel explores themes of virtue, social status, and the struggle for personal autonomy in an oppressive society."
  },
  {
    "title": "The Moonstone",
    "author": "Wilkie Collins",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"The Moonstone\" by Wilkie Collins is a pioneering detective novel that revolves around the mysterious disappearance of a valuable diamond known as the Moonstone. The story unfolds through multiple narrators, each offering unique perspectives as they unravel secrets and motives surrounding the gem's theft, blending elements of mystery, suspense, and social commentary."
  },
  {
    "title": "The Quiet American",
    "author": "Graham Greene",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Quiet American\" by Graham Greene is a poignant novel set in Vietnam during the French colonial war, exploring the complex interplay of politics, love, and morality. Through the eyes of a British journalist, the story delves into the impact of foreign intervention as a naive American idealist becomes embroiled in the conflict's dark realities."
  },
  {
    "title": "Middlesex",
    "author": "Jeffrey Eugenides",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Middlesex\" by Jeffrey Eugenides is a Pulitzer Prize-winning novel that traces the life of Calliope Stephanides, an intersex man raised as a girl, as he navigates his complex identity and family history. The narrative spans generations, exploring themes of gender, immigration, and the American experience, all intertwined with a rich tapestry of Greek-American culture."
  },
  {
    "title": "The Man Who Loved Children",
    "author": "Christina Stead",
    "category": "800 Literature",
    "genre": "Family & Relationships",
    "description": "\"The Man Who Loved Children\" by Christina Stead is a poignant exploration of family dynamics, centered around the chaotic and often tumultuous relationship between a self-absorbed father, Sam Pollit, and his wife, Henny, as they navigate their dysfunctional marriage and the challenges of raising their children. The novel delves into themes of love, selfishness, and the moral complexities of parenthood, painting a vivid portrait of a family caught in emotional turmoil."
  },
  {
    "title": "A Vindication of the Rights of Woman",
    "author": "Mary Wollstonecraft",
    "category": "300 Social Sciences",
    "genre": "Cultural",
    "description": "\"A Vindication of the Rights of Woman,\" written by Mary Wollstonecraft in 1792, is a pioneering work of feminist philosophy that argues for the equality of women and advocates for their education and empowerment. Wollstonecraft contends that women should be seen as rational beings with the same rights as men, challenging societal norms and calling for reforms in women's education and social status."
  },
  {
    "title": "I Capture the Castle",
    "author": "Dodie Smith",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"I Capture the Castle\" is a coming-of-age novel set in 1930s England, narrated by the imaginative and introspective sixteen-year-old Cassandra Mortmain. Living in a crumbling castle with her eccentric family, she documents her dreams, the complexities of love, and the challenges of societal expectations as she navigates her transition into adulthood."
  },
  {
    "title": "Memoirs From Beyond the Grave",
    "author": "François-Auguste-René de Chateaubriand",
    "category": "800 Literature",
    "genre": "Memoir",
    "description": "\"Memoirs From Beyond the Grave\" is an introspective work by François-Auguste-René de Chateaubriand, blending autobiography and philosophical reflection. Written in a fragmented style, it explores themes of memory, existence, and the author's experiences throughout the tumultuous periods of the French Revolution and beyond."
  },
  {
    "title": "The Education of Henry Adams",
    "author": "Henry Adams",
    "category": "800 Literature",
    "genre": "Autobiography",
    "description": "\"The Education of Henry Adams\" is an autobiographical work that reflects the author's experiences and thoughts on the challenges of adapting to a rapidly changing American society in the late 19th century. Through a blend of personal narrative and historical analysis, Adams explores themes of progress, education, and the complexities of modernity against the backdrop of significant political and technological shifts."
  },
  {
    "title": "Americanah",
    "author": "Chimamanda Ngozi Adichie",
    "category": "800 Literature",
    "genre": "Contemporary",
    "description": "\"Americanah\" by Chimamanda Ngozi Adichie follows the story of Ifemelu and Obinze, two young lovers from Nigeria who navigate their identities and experiences as they move between their home country and the United States. The novel explores themes of race, immigration, and the complexities of love and belonging in a globalized world."
  },
  {
    "title": "The Ragged Trousered Philanthropists",
    "author": "Robert Tressell, Peter Miles",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"The Ragged Trousered Philanthropists\" by Robert Tressell is a compelling socialist novel set in early 20th-century England, focusing on the lives of working-class painters and decorators who navigate the struggles of poverty and exploitation. Through the characters' experiences and conversations, Tressell critiques capitalism while advocating for social change and workers' rights."
  },
  {
    "title": "We",
    "author": "Yevgeny Zamyatin",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"We\" by Yevgeny Zamyatin is a dystopian novel set in a future society governed by strict utilitarianism and conformity, where personal freedoms are suppressed for the sake of collective order. The story follows D-503, a state mathematician, as he begins to question the oppressive regime and experiences an awakening through love and individuality, challenging the very foundations of his society."
  },
  {
    "title": "History of My Life",
    "author": "Giacomo Casanova",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"History of My Life\" is the vividly detailed memoir of Giacomo Casanova, the 18th-century Venetian adventurer and libertine, chronicling his romantic escapades, varied professions, and encounters with notable figures of his time. Through captivating storytelling, Casanova provides a rich glimpse into the social and cultural milieu of Enlightenment Europe, blending autobiography with historical commentary and a touch of scandal."
  },
  {
    "title": "Das Kapital",
    "author": "Karl Marx",
    "category": "800 Literature",
    "genre": "Nonfiction",
    "description": "\"Das Kapital,\" written by Karl Marx, is a foundational text in Marxist theory that analyzes the capitalist mode of production, focusing on its economic structures and social implications. It critiques capitalism's inherent inequalities and explores the dynamics of labor, value, and capital, providing a transformative lens through which to understand economic systems and class relations."
  },
  {
    "title": "The Human Comedy",
    "author": "Honoré de Balzac",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"The Human Comedy\" is a vast collection of interlinked stories and novels by Honoré de Balzac that vividly depicts 19th-century French society. Through a diverse cast of characters, Balzac explores themes of ambition, love, and social class, painting a comprehensive portrait of human nature and the complexities of life."
  },
  {
    "title": "Solaris",
    "author": "Stanislaw Lem",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Solaris\" by Stanislaw Lem explores the story of psychologist Kris Kelvin, who is sent to a space station orbiting the mysterious ocean planet Solaris, where the ocean seems to manifest human subconscious thoughts into physical forms. As he grapples with these surreal experiences, the novel delves into themes of communication, the limits of human understanding, and the nature of consciousness."
  },
  {
    "title": "A Fine Balance",
    "author": "Rohinton Mistry",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"A Fine Balance\" by Rohinton Mistry is a poignant novel set in India during the tumultuous period of the Emergency in the 1970s. It intricately weaves the lives of four disparate characters—a tailor, a student, a widow, and a freelance writer—who come together in a small apartment, exploring themes of resilience, compassion, and the intricate balance between hope and despair in the face of adversity."
  },
  {
    "title": "American Pastoral",
    "author": "Philip Roth",
    "category": "800 Literature",
    "genre": "Family & Relationships",
    "description": "\"American Pastoral\" by Philip Roth explores the life of Seymour \"Swede\" Levov, a successful Jewish businessman in post-war America whose idyllic existence unravels when his daughter becomes involved in radical political violence. The novel delves into themes of identity, the complexities of American life, and the disillusionment that often follows the pursuit of the so-called American Dream."
  },
  {
    "title": "Jude the Obscure",
    "author": "Thomas Hardy",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Jude the Obscure\" by Thomas Hardy follows the life of Jude Fawley, a stonemason with aspirations of becoming a scholar, as he grapples with societal constraints, unfulfilled dreams, and tragic relationships. The novel critiques Victorian social norms and explores themes of love, education, and the struggles of the individual against societal expectations."
  },
  {
    "title": "The Secret Garden",
    "author": "Frances Hodgson Burnett",
    "category": "800 Literature",
    "genre": "Children's books",
    "description": "*The Secret Garden* by Frances Hodgson Burnett tells the story of Mary Lennox, a spoiled and lonely orphan who discovers a hidden, neglected garden on her uncle's estate. As she and her new friends restore the garden, they all undergo profound personal transformations, learning about friendship, healing, and the beauty of nature."
  },
  {
    "title": "The Sea, The Sea",
    "author": "Iris Murdoch",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Sea, The Sea\" by Iris Murdoch follows the introspective journey of Charles Arrowby, a retired theater director who retreats to a seaside home to contemplate his life and past relationships. As he grapples with love, obsession, and the complexities of human nature, the novel delves into themes of identity, art, and the interplay between reality and illusion."
  },
  {
    "title": "Philosophical Investigations",
    "author": "Ludwig Wittgenstein",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "\"Philosophical Investigations\" by Ludwig Wittgenstein challenges traditional conceptions of philosophy, focusing on the intricate relationship between language, meaning, and everyday use. Through a series of engaging remarks and explorations, Wittgenstein invites readers to reconsider how our understanding of concepts shapes our experience of the world."
  },
  {
    "title": "Our Mutual Friend",
    "author": "Charles Dickens",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"Our Mutual Friend\" by Charles Dickens explores themes of money, love, and social class through the lives of a diverse cast of characters in Victorian London. The story revolves around the mysterious inheritance of a fortune from a drowned man, unraveling the complexities of human relationships and societal values as various individuals vie for wealth and status."
  },
  {
    "title": "Notes from the Underground",
    "author": "Fyodor Dostoevsky",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Notes from the Underground\" is a novella by Fyodor Dostoevsky that delves into the mind of an unnamed underground man, a cynical and disillusioned former civil servant living in St. Petersburg. Through his complex monologues, the narrative explores themes of free will, existentialism, and the conflict between reason and emotion, offering a profound critique of rational egoism and modern society."
  },
  {
    "title": "Relativity",
    "author": "Albert Einstein",
    "category": "000 Generalities",
    "genre": "Encyclopedic",
    "description": "\"Relativity\" by Albert Einstein is a foundational work that outlines the theories of special and general relativity, revolutionizing our understanding of time, space, and gravity. Through clear explanations and thought experiments, Einstein presents complex concepts in a way that emphasizes their profound implications for physics and our perception of the universe."
  },
  {
    "title": "Do Androids Dream of Electric Sheep?",
    "author": "Philip K. Dick",
    "category": "500 Science",
    "genre": "Cyberpunk",
    "description": "\"Do Androids Dream of Electric Sheep?\" by Philip K. Dick explores a post-apocalyptic world where humans co-exist with androids. The story follows bounty hunter Rick Deckard as he grapples with the moral implications of \"retiring\" rogue androids and questions what it means to be truly human."
  },
  {
    "title": "Another Country",
    "author": "James Baldwin",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Another Country\" by James Baldwin explores themes of love, race, and sexuality in 1960s America through the intertwined lives of a group of friends in New York City. The novel delves into their struggles with identity and connection, revealing the complexities of human relationships against a backdrop of societal tensions."
  },
  {
    "title": "Let Us Now Praise Famous Men",
    "author": "James Agee",
    "category": "300 Social Sciences",
    "genre": "Americana",
    "description": "\"Let Us Now Praise Famous Men\" is a groundbreaking work of literary journalism by James Agee, published in 1941, that profiles impoverished tenant farmers in the Southern United States during the Great Depression. Through a combination of rich prose and poignant photography by Walker Evans, the book captures the dignity and struggles of its subjects, elevating their everyday lives to a profound exploration of American identity and social justice."
  },
  {
    "title": "Collected Poems",
    "author": "Wallace Stevens",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Collected Poems\" by Wallace Stevens is a comprehensive compilation of the poet's works, showcasing his unique ability to merge complex philosophical ideas with rich imagery and sound. Through themes of imagination, reality, and the nature of art, Stevens invites readers to explore the depths of human experience and perception."
  },
  {
    "title": "Critique of Pure Reason",
    "author": "Immanuel Kant",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "\"Critique of Pure Reason\" by Immanuel Kant is a foundational philosophical work that investigates the limitations and scope of human understanding, exploring the relationship between experience and knowledge. Kant argues for the necessity of synthesizing empirical data through innate concepts to form meaningful knowledge, ultimately laying the groundwork for modern epistemology and metaphysics."
  },
  {
    "title": "The Origins of Totalitarianism",
    "author": "Hannah Arendt",
    "category": "300 Social Sciences",
    "genre": "Cultural",
    "description": "\"The Origins of Totalitarianism\" by Hannah Arendt explores the roots and mechanisms of totalitarian regimes, particularly focusing on Nazism and Stalinism. Arendt examines how these political systems emerged from historical contexts, including imperialism and anti-Semitism, and analyzes their impact on individual freedom and society."
  },
  {
    "title": "The Myth of Sisyphus",
    "author": "Albert Camus",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Myth of Sisyphus\" by Albert Camus explores the concept of absurdism, questioning the search for meaning in a seemingly indifferent universe. Through the myth of Sisyphus, who is eternally condemned to roll a boulder uphill only to watch it roll back down, Camus illustrates the struggle against life's inherent meaninglessness and advocates for embracing one's own existence despite the futility."
  },
  {
    "title": "The Notebooks of Malte Laurids Brigge",
    "author": "Rainer Maria Rilke",
    "category": "800 Literature",
    "genre": "Diaries & Journals",
    "description": "\"The Notebooks of Malte Laurids Brigge\" by Rainer Maria Rilke is a introspective novel that follows the thoughts and experiences of a young poet named Malte as he navigates life in Paris. Through his reflections on existence, loneliness, and the nature of art, the book explores deep philosophical themes and offers a poignant commentary on the human condition."
  },
  {
    "title": "The Federalist Papers",
    "author": "Alexander Hamilton, James Madison, John Jay",
    "category": "800 Literature",
    "genre": "Mythological",
    "description": "The Federalist Papers is a collection of 85 essays written by Alexander Hamilton, James Madison, and John Jay that advocate for the ratification of the United States Constitution. These writings articulate the principles of federalism, the necessity of a strong central government, and the importance of checks and balances, serving as a crucial guide to understanding the nation's foundational political philosophy."
  },
  {
    "title": "The Razor's Edge",
    "author": "W. Somerset Maugham",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Razor's Edge\" by W. Somerset Maugham follows the journey of Larry Darrell, a disillusioned World War I veteran seeking spiritual fulfillment and meaning in life, as he explores various philosophies and cultures. Through the perspectives of different characters, the novel examines themes of self-discovery, the pursuit of authenticity, and the contrast between materialism and spiritual enlightenment."
  },
  {
    "title": "W, or the Memory of Childhood",
    "author": "Georges Perec",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"W, or the Memory of Childhood\" by Georges Perec explores themes of memory, identity, and trauma through a dual narrative that juxtaposes the author's childhood experiences with a fictional story set in a dystopian world. Blending autobiography and imaginative storytelling, Perec reflects on the impact of his early life, particularly the loss and displacement he faced during World War II, while examining how memories shape our perceptions and sense of self."
  },
  {
    "title": "War of the Worlds",
    "author": "H. G. Wells",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"War of the Worlds\" by H.G. Wells is a pioneering science fiction novel that depicts an invasion of Earth by Martians. Through the eyes of an unnamed narrator, the story explores humanity’s struggle for survival amidst the chaos and destruction wrought by advanced extraterrestrial forces."
  },
  {
    "title": "Atlas Shrugged",
    "author": "Ayn Rand",
    "category": "800 Literature",
    "genre": "Dystopian",
    "description": "\"Atlas Shrugged\" by Ayn Rand is a philosophical novel that explores the role of individualism and capitalism in society. It follows the story of a dystopian world where the greatest minds and innovators, led by the enigmatic John Galt, choose to withdraw their talents in protest against an oppressive government that stifles creativity and productivity."
  },
  {
    "title": "Stranger in a Strange Land",
    "author": "Robert A. Heinlein",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Stranger in a Strange Land\" by Robert A. Heinlein follows the story of Valentine Michael Smith, a human raised by Martians who returns to Earth and struggles to understand human culture and societal norms. Through his unique perspective, Smith challenges conventional beliefs about religion, sexuality, and individuality, sparking profound questions about identity and humanity."
  },
  {
    "title": "The Silence of the Lambs",
    "author": "Thomas Harris",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"The Silence of the Lambs\" by Thomas Harris follows FBI trainee Clarice Starling as she seeks the assistance of the incarcerated cannibalistic serial killer Dr. Hannibal Lecter to catch another elusive murderer known as Buffalo Bill. This psychological thriller explores themes of manipulation, horror, and the complexities of the human psyche as Starling delves deeper into the mind of a monster to prevent further violence."
  },
  {
    "title": "The Alchemist",
    "author": "Paulo Coelho",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Alchemist\" by Paulo Coelho follows the journey of Santiago, a young shepherd who dreams of discovering a hidden treasure located near the Egyptian pyramids. Through his adventures, Santiago learns profound lessons about following one’s personal legend and the interconnectedness of all life."
  },
  {
    "title": "Parade's End",
    "author": "Ford Madox Ford",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Parade's End\" by Ford Madox Ford is a modernist novel that explores the complexities of love, war, and social change through the experiences of its protagonist, Christopher Tietjens, an English gentleman torn between duty and personal desire during World War I. The narrative delves into themes of morality, class distinctions, and the impact of war on human relationships, all while capturing the tumultuous period of early 20th-century England."
  },
  {
    "title": "The Souls of Black Folk",
    "author": "W. E. B. Du Bois",
    "category": "300 Social Sciences",
    "genre": "Cultural",
    "description": "\"The Souls of Black Folk\" by W. E. B. Du Bois is a seminal work that explores the complexities of African American identity and experience in the early 20th century. Through a series of essays, Du Bois addresses issues of race, inequality, and the struggle for civil rights, advocating for the importance of education and cultural understanding in overcoming racial barriers."
  },
  {
    "title": "The Glass Bead Game",
    "author": "Hermann Hesse",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Glass Bead Game,\" also known as \"Magister Ludi,\" is a philosophical novel by Hermann Hesse that explores the life of Josef Knecht, a gifted individual in a future society dedicated to intellectual pursuits and the arts. The narrative delves into themes of spirituality, the synthesis of knowledge, and the tension between individuality and conformity, ultimately reflecting on the meaning of life and the quest for personal fulfillment."
  },
  {
    "title": "The Joy Luck Club",
    "author": "Amy Tan",
    "category": "800 Literature",
    "genre": "Family & Relationships",
    "description": "\"The Joy Luck Club\" by Amy Tan weaves together the stories of four Chinese-American daughters and their immigrant mothers, exploring the cultural and generational divides that shape their relationships. Through intertwining narratives, the novel delves into themes of identity, heritage, and the complexities of mother-daughter bonds, ultimately celebrating resilience and understanding across cultures."
  },
  {
    "title": "The Feminine Mystique",
    "author": "Betty Friedan",
    "category": "300 Social Sciences",
    "genre": "Counselling",
    "description": "\"The Feminine Mystique\" by Betty Friedan explores the dissatisfaction and sense of entrapment experienced by many women in the mid-20th century, challenging the idealized image of domesticity and femininity that defined their roles. The book ignited a new wave of feminism by prompting women to seek fulfillment beyond the traditional confines of marriage and motherhood, ultimately transforming societal perceptions of gender roles."
  },
  {
    "title": "The Prophet",
    "author": "Kahlil Gibran",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Prophet\" by Kahlil Gibran is a poetic philosophical work comprising a series of lyrical essays delivered by Almustafa, who shares profound insights on various aspects of life, including love, joy, freedom, and sorrow. Through his reflections, Gibran invites readers to explore the deeper meanings of existence and the interconnectedness of the human experience."
  },
  {
    "title": "The Crying of Lot 49",
    "author": "Thomas Pynchon",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"The Crying of Lot 49\" follows Oedipa Maas as she navigates a complex conspiracy involving a secret postal service called the Tristero. As she uncovers layers of meaning in her world, Pynchon explores themes of communication, paranoia, and the search for meaning in a fragmented reality."
  },
  {
    "title": "Effi Briest",
    "author": "Theodor Fontane",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Effi Briest\" by Theodor Fontane tells the story of a young woman who enters a loveless marriage and struggles with societal expectations and her own desires. As she navigates the constraints of 19th-century Prussian society, her tragic fate unfolds, highlighting themes of duty, repression, and the consequences of personal choices."
  },
  {
    "title": "Melmoth the Wanderer",
    "author": "Charles Robert Maturin",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Melmoth the Wanderer\" by Charles Robert Maturin is a Gothic novel that follows the story of Melmoth, a doomed man who sells his soul for an extended life, wandering the world in search of a companion to share his torment. The narrative intertwines multiple tales of despair, exploring themes of existential dread, the nature of evil, and the quest for redemption."
  },
  {
    "title": "Parallel Lives",
    "author": "Plutarch",
    "category": "900 History & Geography",
    "genre": "Ancient",
    "description": "\"Parallel Lives\" by Plutarch is a series of biographies that pairs notable Greek and Roman figures, drawing moral comparisons between them. Through these narratives, Plutarch explores themes of virtue, leadership, and fate, providing insights into the character and values of both cultures."
  },
  {
    "title": "Ramayana",
    "author": "Valmiki",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "The \"Ramayana,\" an ancient Indian epic attributed to the sage Valmiki, narrates the life and adventures of Prince Rama, who embarks on a noble quest to rescue his wife Sita from the demon king Ravana. Through its profound themes of duty, righteousness, and devotion, the epic explores the struggles between good and evil, ultimately highlighting the virtues of love, honor, and sacrifice."
  },
  {
    "title": "Ragtime",
    "author": "E. L. Doctorow",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Ragtime\" by E.L. Doctorow intricately weaves together the lives of fictional and historical figures in early 20th-century America, exploring themes of identity, social change, and the American Dream. Set against the backdrop of significant historical events, the narrative captures the struggles and aspirations of diverse characters, reflecting the complexities of a nation in transformation."
  },
  {
    "title": "Play It As It Lays",
    "author": "Joan Didion",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Play It As It Lays\" by Joan Didion follows the life of Maria Wyeth, a disenchanted actress navigating the bleak landscape of 1970s Los Angeles. The novel delves into themes of existential despair, identity, and the moral decay of Hollywood, capturing the emotional turmoil and alienation of its protagonist."
  },
  {
    "title": "The Code of the Woosters",
    "author": "P. G. Wodehouse",
    "category": "800 Literature",
    "genre": "Cozy",
    "description": "\"The Code of the Woosters\" by P.G. Wodehouse follows the bumbling yet endearing Bertie Wooster as he navigates a series of comedic misadventures involving stolen silver, romantic entanglements, and the ever-looming threat of his formidable Aunt Agatha. With the invaluable assistance of his clever valet Jeeves, Bertie attempts to untangle the increasingly absurd situations that arise from his well-meaning but misdirected intentions."
  },
  {
    "title": "Jacques the Fatalist and His Master",
    "author": "Denis Diderot",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "\"Jacques the Fatalist and His Master\" is a philosophical novel by Denis Diderot that follows the journey of Jacques, a servant, and his enigmatic master as they engage in discussions about fate and free will. Through a series of humorous and thought-provoking encounters, the novel explores the interconnectedness of human experiences and the unpredictability of life."
  },
  {
    "title": "Gormenghast",
    "author": "Mervyn Peake",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"Gormenghast\" is the second book in Mervyn Peake's acclaimed trilogy, set in the vast, crumbling castle of Gormenghast, where the rituals and traditions of its inhabitants shape their lives. The story follows the coming-of-age of Titus Groan, the reluctant heir, as he navigates a world filled with eccentric characters, dark intrigues, and the inexorable pull of destiny."
  },
  {
    "title": "Eugene Onegin",
    "author": "Alexander Pushkin",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Eugene Onegin\" is a novel in verse by Alexander Pushkin that explores themes of unrequited love, societal norms, and the complexities of human relationships through the story of the eponymous hero, a disenchanted aristocrat. The narrative follows his interactions with the passionate Tatyana and his eventual regrets over lost opportunities, set against the backdrop of 19th-century Russian society."
  },
  {
    "title": "Casino Royale",
    "author": "Ian Fleming",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"Casino Royale\" by Ian Fleming introduces the iconic British secret agent James Bond as he embarks on a high-stakes mission to bankrupt a notorious enemy, Le Chiffre, at a high-profile poker game in Montenegro. The novel combines espionage, intrigue, and glamour, setting the stage for Bond's enduring legacy in the world of spy fiction."
  },
  {
    "title": "The Princess Bride",
    "author": "William Goldman",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"The Princess Bride\" by William Goldman is a whimsical tale that combines adventure, romance, and humor, centered around the quest of Westley to rescue his true love, Princess Buttercup, from an evil prince. The story embraces a unique narrative style, featuring various characters and metafictional commentary, making it a beloved classic for readers of all ages."
  },
  {
    "title": "The Immoralist",
    "author": "André Gide",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Immoralist\" by André Gide follows the journey of Michel, a young man who embarks on a quest for self-discovery that leads him to embrace a hedonistic lifestyle, ultimately challenging societal norms and moral conventions. As he grapples with his sexuality and personal desires, Michel's experiences expose the complexities of human nature and the struggle between individual freedom and societal expectations."
  },
  {
    "title": "Household Tales",
    "author": "Brothers Grimm",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"Household Tales\" by the Brothers Grimm is a collection of traditional folk stories that capture the essence of German folklore and fairy tales, featuring iconic characters such as Cinderella, Rumpelstiltskin, and Little Red Riding Hood. The tales blend moral lessons with enchanting narratives, showcasing themes of resilience, cunning, and the triumph of good over evil."
  },
  {
    "title": "The Bluest Eye",
    "author": "Toni Morrison",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Bluest Eye\" by Toni Morrison tells the poignant story of Pecola Breedlove, an African American girl who longs for blue eyes and white beauty in a society that devalues her existence. Through her journey of trauma and despair, the novel explores themes of racism, identity, and the destructive nature of societal standards of beauty."
  },
  {
    "title": "Bouvard et Pécuchet",
    "author": "Gustave Flaubert",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"Bouvard et Pécuchet\" by Gustave Flaubert follows the story of two clerks who, after coming into an inheritance, impulsively pursue a series of intellectual pursuits, including philosophy, literature, and science, in their relentless quest for knowledge. Ultimately, their misguided attempts lead to farcical failures, revealing the absurdity of their blind ambition and the limitations of self-education."
  },
  {
    "title": "Waiting for the Barbarians",
    "author": "J. M. Coetzee",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Waiting for the Barbarians\" by J.M. Coetzee tells the story of a nameless magistrate in a remote colonial outpost who grapples with moral dilemmas as he witnesses the brutal treatment of indigenous people by the empire. Through his internal conflict and interactions with a captured barbarian girl, the novel explores themes of power, colonialism, and the complexities of justice and humanity."
  },
  {
    "title": "Pensées",
    "author": "Blaise Pascal",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Pensées\" is a collection of thoughts and reflections by Blaise Pascal, exploring themes of faith, reason, and the human condition. Written in the 17th century, it offers profound insights into religion and philosophy, blending personal conviction with a deep understanding of humanity's struggles."
  },
  {
    "title": "Roots",
    "author": "Alex Haley",
    "category": "800 Literature",
    "genre": "Biography",
    "description": "\"Roots\" by Alex Haley is a historical novel that traces the author’s ancestry back to Kunta Kinte, a West African man captured and sold into slavery in the United States. Through vivid storytelling, the book explores themes of identity, resilience, and the enduring effects of slavery on generations of African Americans."
  },
  {
    "title": "Romeo and Juliet",
    "author": "William Shakespeare",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Romeo and Juliet\" is a tragic play by William Shakespeare that tells the story of two young star-crossed lovers whose families are embroiled in a longstanding feud. Their passionate romance leads to heart-wrenching consequences, highlighting themes of love, fate, and the destructive power of hatred."
  },
  {
    "title": "A Brief History of Time",
    "author": "Stephen Hawking",
    "category": "000 Generalities",
    "genre": "Encyclopedic",
    "description": "\"A Brief History of Time\" by Stephen Hawking explores the fundamental concepts of cosmology, including the nature of black holes, the Big Bang, and the fabric of time and space. Written for a general audience, the book seeks to clarify complex scientific theories and their implications for understanding the universe."
  },
  {
    "title": "Tractatus Logico-Philosophicus",
    "author": "Ludwig Wittgenstein",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "\"Tractatus Logico-Philosophicus\" by Ludwig Wittgenstein is a seminal philosophical text that explores the relationship between language, reality, and thought. Through a series of numbered propositions, Wittgenstein argues that the structure of language mirrors the structure of reality, ultimately positing that the limits of language are the limits of our world."
  },
  {
    "title": "The Secret Agent",
    "author": "Joseph Conrad",
    "category": "800 Literature",
    "genre": "Crime",
    "description": "\"The Secret Agent\" by Joseph Conrad is a gripping narrative that delves into the world of espionage and political intrigue in late 19th-century London. The story follows Mr. Verloc, a secret agent who becomes entangled in a dangerous plot involving anarchists and government spies, ultimately exploring themes of loyalty, betrayal, and the moral complexities of his work."
  },
  {
    "title": "The Castle of Otranto",
    "author": "Horace Walpole",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Castle of Otranto,\" written by Horace Walpole, is considered one of the first Gothic novels, blending elements of horror, romance, and supernatural intrigue. The story unfolds in a mysterious castle where a prince’s quest for love and justice is thwarted by ominous forces, including a giant helmet and spectral apparitions, ultimately exploring themes of power, fate, and the supernatural."
  },
  {
    "title": "Moll Flanders",
    "author": "Daniel Defoe",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Moll Flanders\" by Daniel Defoe follows the life of its titular character, a clever and resourceful woman who navigates the challenges of 17th-century England through a series of marriages, thefts, and moral dilemmas. The novel explores themes of class, gender, and survival as Moll seeks wealth and security in a harsh and judgmental society."
  },
  {
    "title": "Amerika",
    "author": "Franz Kafka",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"Amerika,\" also known as \"The Stoker,\" is Franz Kafka's unfinished novel that follows the journey of a young European immigrant named Karl Rossmann, who is sent to America by his parents after a scandal. Through a series of surreal and absurd encounters, Karl navigates the complexities of American society, exploring themes of alienation, identity, and the disillusionment of the American dream."
  },
  {
    "title": "Revolutionary Road",
    "author": "Richard Yates",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Revolutionary Road\" by Richard Yates is a poignant exploration of the disillusionment of suburban life in the 1950s, following the lives of Frank and April Wheeler as they grapple with their unfulfilled dreams and societal expectations. The novel delves into themes of conformity, isolation, and the struggle for personal authenticity, ultimately revealing the fragility of human relationships and the pursuit of happiness."
  },
  {
    "title": "A Doll's House",
    "author": "Henrik Ibsen",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"A Doll's House\" by Henrik Ibsen is a groundbreaking play that explores the constraints of gender roles and the struggle for self-identity within a marriage. The story follows Nora Helmer as she confronts her suffocating domestic life and ultimately asserts her independence, challenging societal expectations in 19th-century Norway."
  },
  {
    "title": "Ada or Ardor",
    "author": "Vladimir Nabokov",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "\"Ada or Ardor\" by Vladimir Nabokov is a complex and richly poetic novel that explores the intertwined lives of Ada Veen and her brother, Van, as they navigate a world of forbidden love and the nature of time. Set in a fictional universe that mirrors a distorted version of reality, the novel delves into themes of memory, desire, and the intricacies of human relationships, all while showcasing Nabokov's masterful prose and intricate narrative style."
  },
  {
    "title": "Death Comes for the Archbishop",
    "author": "Willa Cather",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Death Comes for the Archbishop\" by Willa Cather follows the life of Bishop Jean Latour as he navigates the challenges of establishing a Catholic presence in the rugged landscapes of New Mexico. The novel beautifully explores themes of faith, culture, and the spiritual journey against the backdrop of the region's rich history and diverse communities."
  },
  {
    "title": "Bartleby the Scrivener",
    "author": "Herman Melville",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Bartleby, the Scrivener\" by Herman Melville is a short story that explores themes of isolation and the human condition through the character of Bartleby, a law copyist who insists on expressing his preference for non-participation in society by repeatedly saying, \"I would prefer not to.\" The story is narrated by an unnamed lawyer, who grapples with his confusion and frustration as Bartleby's passive resistance transforms from mere indifference to a profound existential withdrawal."
  },
  {
    "title": "The Death of the Heart",
    "author": "Elizabeth Bowen",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Death of the Heart\" by Elizabeth Bowen is a poignant exploration of the complexities of love and alienation through the life of Portia, a young orphan navigating life in a London boarding house. Set against the backdrop of a post-World War I society, the novel delves into themes of emotional vulnerability, betrayal, and the intricacies of human relationships."
  },
  {
    "title": "Eminent Victorians",
    "author": "Lytton Strachey",
    "category": "800 Literature",
    "genre": "Biography",
    "description": "\"Eminent Victorians\" by Lytton Strachey is a groundbreaking biographical work that presents nuanced and often critical examinations of four prominent figures from the Victorian era: Cardinal Manning, Florence Nightingale, Thomas Arnold, and Dr. Samuel Butler. Through a blend of wit and rigorous analysis, Strachey challenges traditional hagiography, offering insights into the complexities of their lives and the societal context in which they operated."
  },
  {
    "title": "Froth on the daydream",
    "author": "Boris Vian",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"Froth on the Daydream\" by Boris Vian is a surreal and imaginative novel that blends romance with fantasy, exploring the complexities of love and existence. Through the story of Colin and his enchanting but tragic relationship with Chloe, Vian employs whimsical elements and vivid imagery to depict the joys and sorrows of life in a dreamlike Paris."
  },
  {
    "title": "Sister Carrie",
    "author": "Theodore Dreiser",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Sister Carrie\" by Theodore Dreiser tells the story of Carrie Meeber, a young woman who moves to Chicago in pursuit of her dreams, only to become entangled in the complexities of love, ambition, and societal expectations. The novel explores themes of desire, moral ambiguity, and the harsh realities of urban life in the late 19th century, highlighting Carrie's struggle for independence and fulfillment in a rapidly changing world."
  },
  {
    "title": "The Passion According to G.H.",
    "author": "Clarice Lispector",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Passion According to G.H.\" by Clarice Lispector follows a woman's existential journey after an unsettling encounter with a cockroach in her maid's empty room. As she grapples with questions of identity, existence, and the nature of reality, the narrative delves deep into her psyche, revealing profound insights about passion, transformation, and the human condition."
  },
  {
    "title": "The Social Contract",
    "author": "Jean-Jacques Rousseau",
    "category": "800 Literature",
    "genre": "Nonfiction",
    "description": "In \"The Social Contract,\" Jean-Jacques Rousseau explores the principles of political legitimacy and the organization of society, arguing that political authority should derive from the collective will of the people, expressed through the concept of the general will. He emphasizes the importance of individual freedom and equality, suggesting that a legitimate state is formed when individuals come together to create a social contract that prioritizes the common good over individual interests."
  },
  {
    "title": "Season of Migration to the North",
    "author": "Al-Tayyib Salih",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Season of Migration to the North\" by Al-Tayyib Salih is a poignant novel that explores themes of identity, colonialism, and cultural conflict through the story of Mustafa Sa’eed, a Sudanese man who returns to his village after studying in England. As he recounts his experiences and relationships, the narrative delves into the complexities of East-West relations and the personal struggles that arise from the clash of cultures."
  },
  {
    "title": "Dubliners",
    "author": "James Joyce",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Dubliners\" is a collection of interconnected short stories by James Joyce that captures the everyday lives of residents in Dublin at the turn of the 20th century. Through poignant and often unflinching portrayals of themes like paralysis, identity, and social class, Joyce illuminates the complexities of human experience within the Irish context."
  },
  {
    "title": "The Vicar of Wakefield",
    "author": "Oliver Goldsmith",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Vicar of Wakefield\" by Oliver Goldsmith is a sentimental novel that follows the story of Dr. Primrose, a kind-hearted vicar, as he navigates the trials and tribulations of life, love, and family in rural England. Through a series of misfortunes and moral lessons, the narrative explores themes of virtue, forgiveness, and the enduring resilience of the human spirit."
  },
  {
    "title": "The Thirty-Nine Steps",
    "author": "John Buchan",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"The Thirty-Nine Steps\" by John Buchan is a thrilling adventure novel that follows Richard Hannay, an ordinary man who becomes embroiled in a deadly espionage plot. As he races against time to clear his name and uncover a conspiracy, Hannay's journey takes him across the Scottish Highlands, blending suspense, action, and clever twists."
  },
  {
    "title": "Nine Stories",
    "author": "J. D. Salinger",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Nine Stories\" by J.D. Salinger is a collection of short stories that delve into the complexities of human experience, often exploring themes of innocence, alienation, and the search for connection. Through his distinctive prose and rich characterizations, Salinger captures the struggles and nuances of life, particularly in the context of post-World War II America."
  },
  {
    "title": "A Handful of Dust",
    "author": "Evelyn Waugh",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"A Handful of Dust\" by Evelyn Waugh tells the story of Tony Last, a disillusioned Englishman who faces the decline of his marriage and the dissolution of his idyllic life amid the changing social landscape of the 1930s. Through sharp wit and dark humor, the novel explores themes of love, loss, and the pursuit of meaning in a world marked by superficiality and decay."
  },
  {
    "title": "Titus Groan",
    "author": "Mervyn Peake",
    "category": "800 Literature",
    "genre": "Dark",
    "description": "\"Titus Groan,\" the first novel in Mervyn Peake's Gormenghast series, introduces readers to the vast, crumbling castle of Gormenghast, where the rituals and traditions of its bizarre inhabitants shape their lives. At the heart of the story is the young heir Titus, who navigates a world filled with eccentric characters and dark intrigue as he grapples with the weight of his destiny within the suffocating confines of his ancestral home."
  },
  {
    "title": "Fortunata and Jacinta",
    "author": "Benito Pérez Galdós",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Fortunata and Jacinta,\" a novel by Benito Pérez Galdós, intricately weaves the lives of two women from different social backgrounds in 19th-century Madrid, exploring themes of love, jealousy, and societal constraints. The story follows the passionate and tumultuous relationship between Fortunata, a working-class woman, and Jacinta, a genteel wife, as they become connected through their shared love for the same man, revealing the complexities of desire and identity."
  },
  {
    "title": "Through the Looking Glass",
    "author": "Lewis Carroll",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"Through the Looking-Glass, and What Alice Found There\" is a sequel to Lewis Carroll's classic \"Alice's Adventures in Wonderland,\" where young Alice steps through a mirror into a fantastical world that operates on the logic of a chess game. In this whimsical realm, she encounters bizarre characters and experiences perplexing situations that challenge her understanding of time, language, and identity."
  },
  {
    "title": "The Hunchback of Notre-Dame",
    "author": "Victor Hugo",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"The Hunchback of Notre-Dame\" by Victor Hugo tells the poignant story of Quasimodo, a deformed bell-ringer of the Notre-Dame Cathedral, who harbors unrequited love for the beautiful Esmeralda. Set against the backdrop of 15th-century Paris, the novel explores themes of love, acceptance, and the struggle between beauty and ugliness in both society and the human heart."
  },
  {
    "title": "Joseph and His Brothers",
    "author": "Thomas Mann",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Joseph and His Brothers\" by Thomas Mann is a sweeping novel that retells the biblical story of Joseph, exploring themes of family dynamics, destiny, and the complexities of human nature. Mann's rich prose and intricate character development breathe life into the ancient tale, examining the relationships between Joseph, his brothers, and their father, Jacob, against the backdrop of a tumultuous time."
  },
  {
    "title": "The Fall",
    "author": "Albert Camus",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Fall\" by Albert Camus is a philosophical novel that explores themes of guilt, judgment, and existential despair through the confessions of Jean-Baptiste Clamence, a former Parisian lawyer. Set in Amsterdam, the narrative unfolds as Clamence reflects on his life while engaging with an unnamed listener, ultimately revealing his own moral contradictions and the complexities of human nature."
  },
  {
    "title": "Poet in New York",
    "author": "Federico García Lorca",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"Poet in New York\" is a collection of poems by Federico García Lorca that reflects his experiences and impressions during his time in New York City in the 1920s. The work captures the disorientation and alienation of urban life, blending surreal imagery with profound emotional depth, while addressing themes of love, nature, and social injustice."
  },
  {
    "title": "Perfume",
    "author": "Patrick Suskind",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Perfume: The Story of a Murderer\" by Patrick Süskind follows the life of Jean-Baptiste Grenouille, an 18th-century Frenchman born with an extraordinary sense of smell but no body odor of his own. Obsessed with creating the perfect scent, he resorts to a series of horrific murders, exploring themes of obsession, identity, and the nature of human desire."
  },
  {
    "title": "The Way We Live Now",
    "author": "Anthony Trollope",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Way We Live Now\" by Anthony Trollope is a satirical novel that explores the moral and social dilemmas of Victorian England, focusing on the lives of various characters entangled in the corrupt world of finance and social status. Through the story of the ambitious and unscrupulous Augustus Melmotte, Trollope critiques the greed and superficiality of society while examining themes of integrity, ambition, and the consequences of deception."
  },
  {
    "title": "The Second World War",
    "author": "Winston Churchill",
    "category": "800 Literature",
    "genre": "20th century",
    "description": "\"The Second World War\" by Winston Churchill is a comprehensive six-volume historical account that chronicles the events of World War II from the perspective of the British Prime Minister. Blending personal memoir with detailed analysis, Churchill offers insights into military strategies, political decisions, and the broader implications of the war."
  },
  {
    "title": "The Book of Job",
    "author": "Unknown",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "The Book of Job is a profound biblical text that explores themes of suffering, faith, and divine justice through the story of Job, a righteous man who endures extreme trials and losses. Throughout his turbulent journey, Job grapples with questions about God's nature and the reasons for human suffering, ultimately seeking understanding and reconciliation with the divine."
  },
  {
    "title": "Dispatches",
    "author": "Michael Herr",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Dispatches\" by Michael Herr is a powerful memoir that conveys the harrowing experiences of a war correspondent during the Vietnam War. The book is renowned for its vivid, lyrical prose and unflinching portrayal of the chaos, brutality, and psychological toll of combat, offering deep insights into the human condition amid the horrors of war."
  },
  {
    "title": "Lost Illusions",
    "author": "Honoré de Balzac",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"Lost Illusions\" by Honoré de Balzac follows the ambitious young poet Lucien Chardon as he navigates the tumultuous world of Parisian society and the literary scene in the early 19th century. Through his rise and fall, Balzac explores themes of ambition, disillusionment, and the harsh realities of artistic and social life."
  },
  {
    "title": "Red Cavalry",
    "author": "Isaac Babel",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Red Cavalry\" is a collection of short stories by Isaac Babel that vividly portrays the experiences of a Jewish journalist serving in the Red Army during the Polish-Soviet War. Through a mix of stark realism and lyrical prose, Babel explores the brutality of war, the complexities of human emotion, and the intricate lives of soldiers and civilians caught in the chaos of revolution."
  },
  {
    "title": "Complete Poems",
    "author": "Elizabeth Bishop",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"Complete Poems\" by Elizabeth Bishop is a comprehensive collection that showcases the American poet's mastery of imagery, emotion, and precision in language. Through her keen observations of nature, personal experiences, and the complexities of human relationships, Bishop's work captures the nuances of life with profound sensitivity and insight."
  },
  {
    "title": "Four Quartets",
    "author": "T. S. Eliot",
    "category": "800 Literature",
    "genre": "Experimental",
    "description": "\"Four Quartets\" by T. S. Eliot is a profound meditation on time, experience, and the spiritual quest for meaning, structured in four interconnected poems. Through rich imagery and complex philosophical reflections, Eliot explores the relationship between the individual and the universe, delving into themes of memory, mortality, and the cyclical nature of existence."
  },
  {
    "title": "The English Patient",
    "author": "Michael Ondaatje",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The English Patient\" by Michael Ondaatje intertwines the lives of four individuals in an Italian villa during World War II, exploring themes of love, memory, and identity. Through the fragmented narratives of a burned British soldier, a Canadian nurse, a Sikh sapper, and aופא woman, the novel delves into their pasts and the haunting impacts of war."
  },
  {
    "title": "The Naked and the Dead",
    "author": "Norman Mailer",
    "category": "800 Literature",
    "genre": "Fiction",
    "description": "\"The Naked and the Dead\" by Norman Mailer is a World War II novel that explores the complexities of human nature and the brutal realities of warfare through the experiences of a diverse group of soldiers on a Pacific island. Combining intense battle scenes with psychological depth, Mailer's work delves into themes of honor, fear, and the struggle for survival in the face of overwhelming adversity."
  },
  {
    "title": "Twenty Thousand Leagues Under the Sea",
    "author": "Jules Verne",
    "category": "800 Literature",
    "genre": "Adventure",
    "description": "\"Twenty Thousand Leagues Under the Sea\" by Jules Verne is an adventurous tale that follows Professor Aronnax, his servant Conseil, and Canadian whaler Ned Land as they are captured by the enigmatic Captain Nemo aboard the submarine Nautilus. Their underwater journey explores uncharted territories and encounters extraordinary sea creatures, ultimately revealing themes of isolation, freedom, and the conflict between mankind and nature."
  },
  {
    "title": "The Kite Runner",
    "author": "Khaled Hosseini",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"The Kite Runner\" by Khaled Hosseini tells the poignant story of Amir, a young boy from Kabul, who grapples with guilt and redemption after betraying his loyal friend Hassan. Set against the backdrop of Afghanistan's tumultuous history, the novel explores themes of friendship, sacrifice, and the lasting impact of past choices."
  },
  {
    "title": "Stories of Ernest Hemingway",
    "author": "Ernest Hemingway",
    "category": "700 Arts & Recreation",
    "genre": "Drama",
    "description": "\"Stories of Ernest Hemingway\" is a curated collection that showcases some of the most iconic works of the celebrated American author. Through vivid storytelling and profound themes of human experience, the book captures Hemingway's distinctive style and explores themes of love, loss, and resilience."
  },
  {
    "title": "Sanctuary",
    "author": "William Faulkner",
    "category": "800 Literature",
    "genre": "Absurdist",
    "description": "\"Sanctuary\" by William Faulkner explores the dark and tumultuous themes of sexual violence, morality, and the corruption inherent in southern society through the story of a young woman's harrowing experience in a distasteful environment. The novel delves into the complex interactions between its characters, highlighting the consequences of their actions and the quest for redemption in a flawed world."
  },
  {
    "title": "Satanic Verses",
    "author": "Salman Rushdie",
    "category": "800 Literature",
    "genre": "Allegorical",
    "description": "\"The Satanic Verses\" by Salman Rushdie intertwines magical realism with deep philosophical and theological themes, exploring identity, faith, and the immigrant experience. The novel incited significant controversy and debate due to its provocative and fictionalized portrayal of Islamic figures, leading to widespread protests and calls for censorship."
  },
  {
    "title": "The Histories of Herodotus",
    "author": "Herodotus",
    "category": "900 History & Geography",
    "genre": "Ancient",
    "description": "\"The Histories\" by Herodotus is an epic account of the Greco-Persian Wars, intertwining historical events with cultural observations from various civilizations of the ancient world. Known as the \"Father of History,\" Herodotus combines storytelling with empirical investigation, providing insights into political, social, and military aspects of the societies he explores."
  },
  {
    "title": "Harriet the Spy",
    "author": "Louise Fitzhugh",
    "category": "800 Literature",
    "genre": "Coming of age",
    "description": "\"Harriet the Spy\" by Louise Fitzhugh follows a young girl named Harriet M. Welsch, who aspires to be a writer and secretly observes the people around her, recording her thoughts in a notebook. When her private observations are discovered, Harriet faces the consequences of her candid opinions and learns valuable lessons about friendship, honesty, and self-acceptance."
  }
]
